[
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "01-23-2014, 03:25 PM#59\nNitrox View Profile\nView Forum Posts\nPrivate Message\nView Articles\nLackey Join Date\nSep 2013\nPosts\n1\nRe: Frustrations with pa's treatment of game and forum\nHello all, well this is my first post on forums. Typically I like to read the posts (some may call it lurking), but I would like to express a few things as well in this section. First, I understand the communication issue, but I do have first hand experience with getting pretty decent response from PA (thank you Airmid) in a few instances in regards to problems. I have lost items from timed out scratchers, and no they did not auto appear and yes I did check, and I have had timed out pvp and EVE, tripped more times in EVE than my ankles can take, and I absolutely despise my luck at crates.\nHowever, here's my biggest frustration....to me this game has three facets; Bosses, EVE, and PVP. Empires are all tracked by and ranked by bosses and EVE, but there is no ranking for empires in PVP. PA has essentially disregarded one third of the game's intent, and I would estimate one of the highest cash draws for the game, especially considering the events all have pvp components. I would guess its a relatively simple fix, rank empires by aggregate players pvp wins minus pvp losses. Obviously battle points would be difficult as points drop so low for higher ranks, but this also gives incentive back to empires who don't want to douse their toons with health just for EVE. Each player gets to strategically create their toon, and so should empires get to strategically create their identities.\nEVE and bosses are fun, but they are becoming stagnant. The new class skills make EVE a bit more interesting, but why not create PVP class skills? Why not create more LTs with PVP skills (thank you for Hotwire by the way, tho Hotwire should be able to steal on golden guns too ). Please PA, show us that BSI builds still have place in the game.\nOh, and PS, that spinning wheel of death before the Request Time Out is the most frustrating thing in the game.\nFREE AGENT\nReply With Quote",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "it would be nice if the true leader of the empire showed, not the underboss.....",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Almost forgot the most important thing.... NEW PVP RANKS! We rainmakers may not mind burning the stam needlessly without getting bp. In truth, it is a truly liberating feeling not to worry about bp anymore. And to be honest, we wouldn't be rainmakers if we didn't enjoy pvp. But some of us have been r24 for months and we are nearing 1/4 players in Free Agent being r24. I think I can take the liberty of saying that most r24 players would like a shot at a new rank. Hook us up PA! ❗B❗B❗B❗ Free Agent",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "I agree with Sam, 7-8 levels per VIP pack is crazy so either increase the stam/energy cap or lower the xp needed to level. in the long run PA are losing money if they dont in my opinion. I dont pvp often but when i do it against a player with high health i hit them half way and it boots me off the game, come back and they are dead, PA took my x really??? the event was complete garbage too i dont even have the words to describe that one. Lag issues are intolerable, and if someone saw my screen during eve they would think im in kindergarten with the amount of times im tripping over.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Bobby View Post I agree with Sam, 7-8 levels per VIP pack is crazy so either increase the stam/energy cap or lower the xp needed to level. in the long run PA are losing money if they dont in my opinion. I dont pvp often but when i do it against a player with high health i hit them half way and it boots me off the game, come back and they are dead, PA took my x really??? the event was complete garbage too i dont even have the words to describe that one. Lag issues are intolerable, and if someone saw my screen during eve they would think im in kindergarten with the amount of times im tripping over. what device are you using? i haven't had any lag/crash problems for a long time. the event ran smoothly for me.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Mja View Post what device are you using? i haven't had any lag/crash problems for a long time. the event ran smoothly for me. Using iphone5. the event ran smoothly but never thought wrapping presents at christmas can be so demoralising",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by SΔM View Post 1- The game play doesn't adapt with playing trends and player levels, example: I will reach a point where I'm gonna get 1-2 levels per VIP pack if i use the FP's to refill my 1000 Stam, currently I get 6 - 7 levels per VIP pack! PA must do the following: Increase the average XP given when hitting bosses or doing Jobs Put a cap on XP needed to level up More FP's in each FP pack with same or lower price removing the cap on stam and energy refills is useless IMO and above points are more convenient 2- Improve the drop rates of LT's in crates, the bar keeps on getting raised by the big spenders and i believe all players have the right to own good LT's 4- Round up the ridiculous chance powers numbers to a damn proper digit (NO .6% and 3.2% crap) Very annoying *OCD much?* Less refills per lvl would simply increase the gap between free players and late lsi players... Imo, it needs to be smaller, I would even reduce the ener/stam given from refills to something like 200+50% of max ener/stam. Why rounding up those powers? Aren't they good enough? Don't you have any respect for those who don't own theses lt? Like xcelier said, lt needs to be weaker. I would suggest a reduction of cap lvl increase, making the star up a bit less rewarding.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Bobby View Post Using iphone5. the event ran smoothly but never thought wrapping presents at christmas can be so demoralising The hole event was a big failure. This is what we get when PA probably doesn't have much time so they just throw shit out to try and make us happy. This event was not very well planned by PA, its easy too see... 1. No information about the LT power. 2. Packing presents, really? PA would made 2x the amount spent on that event if you removed just half of it. 3. When the even stopped i had rank 10. I mean, when the CLOCK stopped ticking.... BUT they never removed the possibility to combine presents before like 2 days after the event was over. So guess what, i lost my rank. Why wouldn't such kind of information be handed out? When an event is over, shouldn't it actually be over? I find it ridiculous, just saying.. But again, when we sum up everything in this thread we end up with either one of these or both: 1. PA have too few employees 2. They have focus on everything else (CA and the new game they are making) than UE.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by eti View Post Less refills per lvl would simply increase the gap between free players and late lsi players... Imo, it needs to be smaller, I would even reduce the ener/stam given from refills to something like 200+50% of max ener/stam. Why rounding up those powers? Aren't they good enough? Don't you have any respect for those who don't own theses lt? Like xcelier said, lt needs to be weaker. I would suggest a reduction of cap lvl increase, making the star up a bit less rewarding. Without spenders this game will not exist, where do you think they make money? They don't make money on free players. That is the real truth. This game will only benefit paying players. thats how it works... How would you run this game if we removed the spenders, eti? You cant expect to go into a casino and win money without spending. Im not attacking you, but this game is made like this. And the \"gap between free and spenders\" - It will never change. But i am stopping this discussion now, more than happy to continue this somewhere else. Make a new thread and ill discuss with you until my hair turns grey.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "After reading through this thread i realize how lucky i am not to really ever have any in game isssues. I think a lot of the crashing issues have more to do with devices than with PA and the game, if it were PA i think everyone would be experiencing it often. My concerns that i've observed since joining in May have been: 1. Forum Control - This has really been addressed as of late and is leaps and bounds ahead of where it was, thank you Matt! 2. Communication - although i have not experienced this myself it seems its a big problem, in my line of work communicaiton is everything, so even a reply that ackowledges reciept of a request and we are working to remedy....etc. could mean a lot to a player. 3. I don't want to say release new content every couple of weeks, i'd rather see someone take there time and polish content rather rush it but there are numerous things that can be done on the interim to keep the game fresh, changing up the Black Market once and a while (even if its just to rotate previous LTs while we wait for a new one). Some small in game events just to keep people involved. Even the small log on events like last year with LT specific equipment. 4. Allow more than 50 people in Doomsday! lol 5. and this is just a gripe, I love the fact that Skull King was the Anniversary LT but i think the skill was way off. My opinion was he should have been a % booster on boss damage. somewhere around the 5-10% range (probably could have gone 10% boss damage and go up 1-2% per star, i don't think this would have caused much problem with the game because of the only buy 1 limit and then high cost to fuse him beyond 2 star) Above all i would just like to see a presense of PA in the forums",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by RipZ View Post Without spenders this game will not exist, where do you think they make money? They don't make money on free players. That is the real truth. This game will only benefit paying players. thats how it works... How would you run this game if we removed the spenders, eti? You cant expect to go into a casino and win money without spending. Im not attacking you, but this game is made like this. And the \"gap between free and spenders\" - It will never change. But i am stopping this discussion now, more than happy to continue this somewhere else. Make a new thread and ill discuss with you until my hair turns grey. I'm not talking about removing spenders, just look at others mmo : spenders spend, as always, but they mostly can't get 20 times stronger than if they wouldn't have paid. Reducing this advantage wouldn't stop spenders to spend, free players could even think about paying a little once in a while. Making free players happier means that you make most players happier, they would ask more to their friends to join them and this would make more spenders on this game.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Lets talk about the epic we got as a reward, reine - on low health, chance for 1.75x damage. first of all what is low health? secondly what do u mean ' chance' for 1.75x damage? if i am going to fuse her i want to know exactly why im doing so",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Bobby View Post Lets talk about the epic we got as a reward, reine - on low health, chance for 1.75x damage. first of all what is low health? secondly what do u mean ' chance' for 1.75x damage? if i am going to fuse her i want to know exactly why im doing so It was explained on another topic. I may add, as a proof that UE was forgotten by most of the devs, that annihilator crate is still considered as \"new\"",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by eti View Post I'm not talking about removing spenders, just look at others mmo : spenders spend, as always, but they mostly can't get 20 times stronger than if they wouldn't have paid. Reducing this advantage wouldn't stop spenders to spend, free players could even think about paying a little once in a while. Making free players happier means that you make most players happier, they would ask more to their friends to join them and this would make more spenders on this game. This makes no sense. The game would not be here if not for the spenders. Why would PA make a change to cater to the free players? I think you are missing the point. PA Is going to loose some of the bigger spenders if they don't fix the amount of FP it takes to level. I'm only a level 950 and it takes me 12,500 XP to level. I would think about quitting playing the game every day if I had to get 25K like some of these level 2,000+ monsters and without those spenders there is no UE",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Bobby View Post Lets talk about the epic we got as a reward, reine - on low health, chance for 1.75x damage. first of all what is low health? secondly what do u mean ' chance' for 1.75x damage? if i am going to fuse her i want to know exactly why im doing so The things you are complaining about are funny. Her ability is insane, learn it before you trash it. Quote Originally Posted by BBB View Post Almost forgot the most important thing.... NEW PVP RANKS! We rainmakers may not mind burning the stam needlessly without getting bp. In truth, it is a truly liberating feeling not to worry about bp anymore. And to be honest, we wouldn't be rainmakers if we didn't enjoy pvp. But some of us have been r24 for months and we are nearing 1/4 players in Free Agent being r24. I think I can take the liberty of saying that most r24 players would like a shot at a new rank. Hook us up PA! ❗B❗B❗B❗ Free Agent That's why pvp players at the top tiers should have to fight daily decay, but receive something daily for holding that title",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Not trashing mate... just wanted clarification thats all",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "I agree with analoverlord and basically every suggestion on here. Starting a new game when you claim to not have the resources to keep up with this one? Where is the logic? Unless pa just hired a bunch of new staff I think we may see this company implode. I love this game so please make smart decisions that plan for the future. And if a monthly newsletter is too difficult to put out one a month take a picture of your notes every once in awhile and post them. It will take 2 minutes and we can at least get an idea of what is to come in the future",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Guys we're getting off track here... I asked that discussions be taken to pms. It seriously hurts the message this thread is trying to send I've mentioned the best solution in other threads regarding refills and it benefits all equitably Back on topic here... Why is there a huge delay on diamond league battles... I recall vanguard in ca doesn't have this bad of a lag... Heck even the Facebook battles don't have this bad of a lag time",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Thanks Adam, yes these are for the most part easy fixes. You know what really bothers me the most? When a new update comes up and they animate bosses or maps. I understand they are trying to make it more appealing to the new players but that stuff should only come second to new content. Like I and others have mentioned for months, when will the new executions coming? The is a great community and stop ignoring us. We are the players you want to keep happy. Please PA, just create some dialog with us. I have seen some very good ideas here and would love for them to be considered.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "I agree with the need for a empire ranking system by PVP, maybe points. For me its all about PVP. I do enjoying winning at EVE but I am not going to waste sp on health. As most of us know to win at EVE you have to have high health. For those that do cool, but it is not what Im about. I am more of a BSI build at 5.02. When secureshell was up I looked forward to seeing my progresssion in PVP. I spent a lot of money on FP so I could PVP more. Now without that yard stick, granted there is the 100k achievment award, I lack the drive to PVP as much or play. Bosses are very boring to me, I do not understand why empires are ranked on bosses? To me it just shows how much money a empire is willling to spend in a month. Yes you level way faster by bosses than any other method, but it would be cool if you could level as fast with PVP. Possibly instead of just 1 stam used you could by lt or level reached use more than 1 stam per attack. This I believe would change the game dramatically. So a a lsi build could go up aginst a bsi build and possibly win by using more than 1 stam per attack, but also you could lose a lot if it did not work. Just an idea. Anyway that is my main complaint. FREE AGENT m/",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page3",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "It does seem like they have some really busy job that keeps them from spending more than a minimal amount of time on UWE. I look at other games and it doesn't look the same. For instance ...\nThere are games that aren't as cool as UWE, but have lots of activity. I'm sure that there are people at PA familiar with the marketing efforts of other companies. Activision and Vicarious Visions have a Skylanders Lost Islands game, that has:\n* A new character in the wishing well each month.\n* Super Tuesday, when some feature of the game changes for the day. Double gold. Extra trolls. Just a wrinkle, just a day.\n* They roll new marketing every Monday. Except when it's on Tuesday. Or when they miss a week.\n* Something is almost always on sale, whether it's a discount on vehicles, buildings, skylanders, or shrines.\nHay Day puts on a contest on Facebook each Friday, and people win in-game prizes.\nReal Racing 3 sends push messages to inactive players offering them in-game prizes to come back and play.\nMy point is that other people, surely less talented and creative than PA staff, are doing things on a schedule, that make the game interesting.\nThe timing cycles make it easy for people to say, \"I'm saving for a sale / promotion. There will be one on Tuesday / Friday and I'll get that shiny new 4-star Kate I've been wanting.\" By contrast, at UWE you find yourself looking down Dirty Harry's gun barrel. \"Do you feel lucky, punk?\" Will I buy FP today, and then tomorrow find that there was a promotion? What impact do you think that has on spending?\nI really like this game, but I have to agree that it feels like they aren't pedaling as fast as some of the kids at the other game companies. Perhaps there are some very reasonable historical experiences that led them to operate this game by remote control. But here's the question I keep coming back to:\nWhy do the other game companies manage to get involved and stay involved? Why does PA choose not to do what seems to common in the industry?\nIf I knew who to ask, I'd ask them. Here on the forums, I would generally expect some disaffected customer to say that it's because of flaws in the character of the people at PA. I refuse to believe that.\nThe guy who designs Ferrari's wants to make a new model every 5 years, not every year. Perhaps PA wants to have the game settle out a bit between updates. (Perhaps not, I'm just trying to think of reasons why they would appear torpid.)",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "I have a extreme disappointment in PA choice in skull kings abilities. I mean really skull king was supposed to be a Lt. for the heavy class, instead they made him a weaker version of duke with auto heal which is stupid BTFW. New class powers for the heavy class are really just a bunch of useless abilities why isn't there a chance to critical a building or even a demo level 4 How about an event that is actually for BSI players. The battle royal was a joke unless you were loaded with cash and had high health In other words PA SUCK IT !!!!!!!!! Promo promo promo promo promo",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "First, we all know PA has a big lack of customer service. Too many request for what u can handle? HIRE PEOPLE. Simple as that. Like some of us, this is the only game I play, I don't even play anything else. Thing that frustrate me a lot, is that we just got an announcement that PA is working on a NEW GAME. WHAT??? You guys working on a new game and can't give us at least some new content to give us something new to enjoy. There is so many people here that help you for FREE, giving suggestions and so many great idea to improve the game. I can't understand how PA can't deal with that. This will also improve the money spent on game for sure. More stuff to do, more money to spend. I do love the current content of the game, it is nice and makes it interesting at some point, but there is a cap, and that cap makes player that want to just quit. Event are OK, but... Always on the same frame. Getting boring. I know someone mentionned about the frequent arena CA has, why don't we have them more frenquently here? On a positive note, thanks for the latest addition to EvE. This change a big part of the gameplay. This is what we want.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },    
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by The swamp father View Post In other words ** **** ** !!!!!!!!! This defeats our purpose of this thread Why not introduce more buildings for eve so we can have varied strategies... Right now every empire in legend has the same building layout and strat... The low end diamonds are where variation starts but that's because they haven't learned yet.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Voodoo jester View Post This defeats our purpose of this thread Why not introduce more buildings for eve so we can have varied strategies... Right now every empire in legend has the same building layout and strat... The low end diamonds are where variation starts but that's because they haven't learned yet. I agree with this. And fix the match-up too. Empires like B00ND0CKS-DOA-AFS-ES and you all know them should not fall to Diamond League SMH. We all know those are Legend Empire...",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Pmich View Post I agree with this. And fix the match-up too. Empires like B00ND0CKS-DOA-AFS-ES and you all know them should not fall to Diamond League SMH. We all know those are Legend Empire... Damn right, Quebec Rules is a high diamond empire, and we got killed within 1h10 yesterday in diamond league... There are empires in diamond that we kill in less than 50 minutes... It's a bit too easy to drop and climb leagues.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Common View Post Lack of communication. There's people rolling around with titles but that means jack shit to me - you either spend time managing or you don't. Lack of updates - we get dry months then a small flurry of activity. There should be new content every month - in terms of maps. Release the new secret areas for the already-completed maps - again, one a month. New FP lts every month. Promos every other weekend - hello, payday = promo. An event every 2-3. New crates every 4-6 months. I have said it before - this is DIGITAL CONTENT - you aren't hand carving something each time you put out a promo with a rare LT, some refills and some CC. This isn't rocket science - the list I just named makes money, why would you not nurture that? I couldnt have wrote that any better myself bro. Amen.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Pmich View Post I agree with this. And fix the match-up too. Empires like B00ND0CKS-DOA-AFS-ES and you all know them should not fall to Diamond League SMH. We all know those are Legend Empire... I can't speak for the others, but ES hasn't been in diamond league since - ever? I mean, when EvE started everyone was in a lower tier and the higher tiers were empty, so empires that were consistently winning could climb up to the new spots. But other than that, ES has been Legend all the way. Just saying. VJ, LOVE the idea of more buildings for varied strategies. A 4x4 or 5x5 grid should be obtainable once empires reach the 90-100 member mark. EvE is like chess or submarine warfare - keep it challenging and varied. The win predictor shouldn't be either: 1) fighting an empire that is waaaaay beneath you (last night ES fought an empire with 49 players. WTF?) 2) fighting an empire that is waaaaay ahead of you (ES is and has been in 7th for the whole season, but to say that we are near the top 5/6 is a totally incorrect statement - huge gap. HUGE. 3) fighting an empire that is very close to you in terms of activity and levels/skills. This is the only type of interesting EvE there is, and one that we in ES only see every other day. Speaking of those member marks... EMPIRE DROPS!!! Soon? Please?",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Voodoo jester View Post Why not introduce more buildings for eve so we can have varied strategies... Right now every empire in legend has the same building layout and strat... The low end diamonds are where variation starts but that's because they haven't learned yet. To make it even easier on PA, don't even add new buildings yet, just add 3 more warehouses so we can mix it up and make other empires guess instead of down the middle all the time",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Also we got a Community manager viewing, please tell us something plz...",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },                          
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "1) Response time in-game and on forum. 2) Promos more frequent. 3) Black market page switched up every month. 4) Work on the \"tripping\" lag in eve. 5) Increase the % on crates, don't have to be alot, but a avg. of 1 outta 20 drop rate on Epic Lts is an insane price when one crate roll cost 30FP($5 bucks?!). This is a fantasy app game, players shouldn't have to pay $100 bucks for a Epic Lt(basing it on single rolls only) just to enjoy the game. That in my opinion, is a little greedy. 6) The pvp ranked empire idea stated above seems like something that should be brainstormed on, that's a good point that pvp is 1/3 of the game yet an empire as a whole's pvp strength isn't relevant when bosses and eve is. 7) Enforce the rules on forum to clean up any and all posts that have no significance to the game regarding opinion, strategy, and respect toward other forum users. 8) Seems as if more staff should be hired to further help the progress and miscues of the game. 9) Release future plans and ideas of what's in store for Underworld Empire thruout the year of 2014. 10) Would seem admirable if gurus and those who have spent so much of their time adding guides, strategies, and other variables to help players get the most out of their UE experience. 11) Class-skill based Lts or any form of Lts that would help a specific class when seated. 12) Lt based new properties that when bought would add to a Lt's skill. For ex.- Pain could have a house in the Slums and would add a 1% crit increase when purchased. New art, background stories on Lts, and new incentives for in-game money. Could be very expensive and could stack when the next fortress is built. 13) New weapons, gear, and vehicles in shop. Once again, the need for in-game money needs added motivation. 14) Empire drops to be released. 15) Empire pvp leaderboards. 16) New tech-lab ingredients. 17) Rewards for empire monthly leaderboards. 18) New bosses, maps, and gifts. Sure I'm leaving something out but just a few of the things that could be done to further the enjoyment and gameplay of the game that as a community want to see prosper. Thanks and god bless.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "I have to agree the lack of communication and response times by PA should be a lot better than it is. I also think that there should be promos a lot more often. It seems like we rarely ever get any. We also need new maps to work on, this keeps the game interesting.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by TheDRR3 View Post 1) Response time in-game and on forum. 2) Promos more frequent. 3) Black market page switched up every month. 4) Work on the \"tripping\" lag in eve. 5) Increase the % on crates, don't have to be alot, but a avg. of 1 outta 20 drop rate on Epic Lts is an insane price when one crate roll cost 30FP($5 bucks?!). This is a fantasy app game, players shouldn't have to pay $100 bucks for a Epic Lt(basing it on single rolls only) just to enjoy the game. That in my opinion, is a little greedy. 6) The pvp ranked empire idea stated above seems like something that should be brainstormed on, that's a good point that pvp is 1/3 of the game yet an empire as a whole's pvp strength isn't relevant when bosses and eve is. 7) Enforce the rules on forum to clean up any and all posts that have no significance to the game regarding opinion, strategy, and respect toward other forum users. 8) Seems as if more staff should be hired to further help the progress and miscues of the game. 9) Release future plans and ideas of what's in store for Underworld Empire thruout the year of 2014. 10) Would seem admirable if gurus and those who have spent so much of their time adding guides, strategies, and other variables to help players get the most out of their UE experience. 11) Class-skill based Lts or any form of Lts that would help a specific class when seated. 12) Lt based new properties that when bought would add to a Lt's skill. For ex.- Pain could have a house in the Slums and would add a 1% crit increase when purchased. New art, background stories on Lts, and new incentives for in-game money. Could be very expensive and could stack when the next fortress is built. 13) New weapons, gear, and vehicles in shop. Once again, the need for in-game money needs added motivation. 14) Empire drops to be released. 15) Empire pvp leaderboards. 16) New tech-lab ingredients. 17) Rewards for empire monthly leaderboards. 18) New bosses, maps, and gifts. Sure I'm leaving something out but just a few of the things that could be done to further the enjoyment and gameplay of the game that as a community want to see prosper. Thanks and god bless. So many great ideas but sadly most of them won't even be considered.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "I remember when..... UE was constantly communicating with us. Customer service was praised for its quick turnarounds and problem solving Updates were regular and had new stuff FP LTs were new every 4-6 weeks Real Promotions Well thought out events with plenty of advance notice Free stuff on Fridays They listened to our suggestions and implemented the good ones. Communication is what made PA successful and can put this game closer to CA in terms of revenue per player too. Get somebody that is thick skinned out here on forums. The day that we stop gripping about something that could be better is the day that you REALLY need to start worrying about this game. Change the FP LT every 4-6 weeks. Even if you recycle an old one, that is fine. I would LOVE the chance to buy Centurion and his equipment. Have a promotion every 6-8 weeks and a mini one in between. I'm a regular spender, but I have 2 alts that only get money spent on them when there is a promo. Hold an event every 3 months. Give us a week's advance notice and let us know what the top prize LT does. Make it possible for people to get 1 just by being active enough in the event. The bar is always set high enough that they have to spend money to get it so they can't cry if they don't. Barron is a fine example, but if you had put Reign there it would have been better. Add new content to the game every 60-75 days. Don't be afraid to throw something special out there in between either. Keep us on our toes. Every once in a while, throw out a surprise on us just to shake things up, a giant boss that all of UE has a week to kill, a Battle Royale EVE style but we are randomly grouped together so that we have to battle with people we don't know. You started something great, you let it slide a bit when it did not equal a game that has been out for years. Get back to great again. You have been working your way back there, just take those last steps.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Dr death View Post I remember when..... UE was constantly communicating with us. Customer service was praised for its quick turnarounds and problem solving Updates were regular and had new stuff FP LTs were new every 4-6 weeks Real Promotions Well thought out events with plenty of advance notice Free stuff on Fridays They listened to our suggestions and implemented the good ones. Communication is what made PA successful and can put this game closer to CA in terms of revenue per player too. Get somebody that is thick skinned out here on forums. The day that we stop gripping about something that could be better is the day that you REALLY need to start worrying about this game. Change the FP LT every 4-6 weeks. Even if you recycle an old one, that is fine. I would LOVE the chance to buy Centurion and his equipment. Have a promotion every 6-8 weeks and a mini one in between. I'm a regular spender, but I have 2 alts that only get money spent on them when there is a promo. Hold an event every 3 months. Give us a week's advance notice and let us know what the top prize LT does. Make it possible for people to get 1 just by being active enough in the event. The bar is always set high enough that they have to spend money to get it so they can't cry if they don't. Barron is a fine example, but if you had put Reign there it would have been better. Add new content to the game every 60-75 days. Don't be afraid to throw something special out there in between either. Keep us on our toes. Every once in a while, throw out a surprise on us just to shake things up, a giant boss that all of UE has a week to kill, a Battle Royale EVE style but we are randomly grouped together so that we have to battle with people we don't know. You started something great, you let it slide a bit when it did not equal a game that has been out for years. Get back to great again. You have been working your way back there, just take those last steps. Yes, yes and more yes.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Dr death View Post I remember when..... UE was constantly communicating with us. Customer service was praised for its quick turnarounds and problem solving Updates were regular and had new stuff FP LTs were new every 4-6 weeks Real Promotions Well thought out events with plenty of advance notice Free stuff on Fridays They listened to our suggestions and implemented the good ones. Communication is what made PA successful and can put this game closer to CA in terms of revenue per player too. Get somebody that is thick skinned out here on forums. The day that we stop gripping about something that could be better is the day that you REALLY need to start worrying about this game. Change the FP LT every 4-6 weeks. Even if you recycle an old one, that is fine. I would LOVE the chance to buy Centurion and his equipment. Have a promotion every 6-8 weeks and a mini one in between. I'm a regular spender, but I have 2 alts that only get money spent on them when there is a promo. Hold an event every 3 months. Give us a week's advance notice and let us know what the top prize LT does. Make it possible for people to get 1 just by being active enough in the event. The bar is always set high enough that they have to spend money to get it so they can't cry if they don't. Barron is a fine example, but if you had put Reign there it would have been better. Add new content to the game every 60-75 days. Don't be afraid to throw something special out there in between either. Keep us on our toes. Every once in a while, throw out a surprise on us just to shake things up, a giant boss that all of UE has a week to kill, a Battle Royale EVE style but we are randomly grouped together so that we have to battle with people we don't know. You started something great, you let it slide a bit when it did not equal a game that has been out for years. Get back to great again. You have been working your way back there, just take those last steps. I honestly couldn't have worded this better myself And like everyone else said, support. To me that's always been lacking. And I'll throw in some examples Your free crate promo months ago I didn't receive so I emailed support, after like a week they flat out stopped communicating with me... Really? I had to go to Artanis to get that sorted I emailed about the heavy bug ages ago with two tokens and getting more points if you were dead. Your response was for me to read the forums about class skills... A month or so ago I reported a big, took like two weeks for a response. The bug is still in the game too lol. While it's nothing major, it just goes to show you how bad your support is I enjoy this game like everyone else. I have spent money like everyone else. I'd really hate to see this game go to crap",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Dr death View Post I remember when..... UE was constantly communicating with us. Customer service was praised for its quick turnarounds and problem solving Updates were regular and had new stuff FP LTs were new every 4-6 weeks Real Promotions Well thought out events with plenty of advance notice Free stuff on Fridays They listened to our suggestions and implemented the good ones. Communication is what made PA successful and can put this game closer to CA in terms of revenue per player too. Get somebody that is thick skinned out here on forums. The day that we stop gripping about something that could be better is the day that you REALLY need to start worrying about this game. Change the FP LT every 4-6 weeks. Even if you recycle an old one, that is fine. I would LOVE the chance to buy Centurion and his equipment. Have a promotion every 6-8 weeks and a mini one in between. I'm a regular spender, but I have 2 alts that only get money spent on them when there is a promo. Hold an event every 3 months. Give us a week's advance notice and let us know what the top prize LT does. Make it possible for people to get 1 just by being active enough in the event. The bar is always set high enough that they have to spend money to get it so they can't cry if they don't. Barron is a fine example, but if you had put Reign there it would have been better. Add new content to the game every 60-75 days. Don't be afraid to throw something special out there in between either. Keep us on our toes. Every once in a while, throw out a surprise on us just to shake things up, a giant boss that all of UE has a week to kill, a Battle Royale EVE style but we are randomly grouped together so that we have to battle with people we don't know. You started something great, you let it slide a bit when it did not equal a game that has been out for years. Get back to great again. You have been working your way back there, just take those last steps. I honestly couldn't have worded this better myself And like everyone else said, support. To me that's always been lacking. And I'll throw in some examples Your free crate promo months ago I didn't receive so I emailed support, after like a week they flat out stopped communicating with me... Really? I had to go to Artanis to get that sorted I emailed about the heavy bug ages ago with two tokens and getting more points if you were dead. Your response was for me to read the forums about class skills... A month or so ago I reported a big, took like two weeks for a response. The bug is still in the game too lol. While it's nothing major, it just goes to show you how bad your support is I enjoy this game like everyone else. I have spent money like everyone else. I'd really hate to see this game go to crap",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Ok pa, balls in your court... As you can see there is no shortage of issues.. And these are just the few that are willing and capable of posting their issues without sending the wrong message to you. Imagine those who aren't capable of this and what they are thinking? You are punishing the rest of the community for the actions of a few jack wagons especially a couple who don't understand your side of things. These individuals haven't been on in months so there's one thing left to say and the following illustrates it quite well This post isn't designed to call you but more to ask you to tear down the barrier you have set up... The community is doing what they can to show you we'll do our part but we can't tear down the barrier you have set up. It's also worth it to mention pa that people have joined forums just to post on this thread..",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },                                                  
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Quote Originally Posted by Voodoo jester View Post Ok pa, balls in your court... As you can see there is no shortage of issues.. And these are just the few that are willing and capable of posting their issues without sending the wrong message to you. Imagine those who aren't capable of this and what they are thinking? You are punishing the rest of the community for the actions of a few jack wagons especially a couple who don't understand your side of things. These individuals haven't been on in months so there's one thing left to say and the following illustrates it quite well This post isn't designed to call you but more to ask you to tear down the barrier you have set up... The community is doing what they can to show you we'll do our part but we can't tear down the barrier you have set up. Amen and THANK YOU!",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },                                                  
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "It is fantastic to see the community actually getting together to try and workout what is obviously some very common and rather widespread issues with PA and this game. Reading each post, it is evident to see the common frustrations people are experiencing and that the community wants change but more importantly a positive one. VJ great work on setting up a constructive thread to show PA that there are people (customers) who really do care about the game and the direction its going and not just another thread full of loud mouths and trolls. I do not have anything further to add as not only are the majority of gripes and frustrations already listed in the posts but also the solutions and recommendations for improvement are all here aswell. Great job all - keep it up! Kats aka Throat Yoghurt FA",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },                                                  
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "hey there! another player since 2012 here. First thing first, communication : the obvious is obviously...obvious. I use to come here to get on my toes because fabulous update were announce, it was literally turning me into a 10 years old at Christmas eve. There were heralds, various type of competitions, funny threads, it was really building my hype...then WWIII (lol), Airmid disappeared and the forum became full of theroux (na mean) and empty...i stopped coming here. Strangely, it matches my spending curve, i don't spend like i use to do because i feel like this game is on his down swing... and they announce a new game??? really?? to replace that one? to restart from scratches? i mean...PA!!! REALLY? I didn't ask around but i'm pretty sure i'm talking for everyone here if i say : there's no way, in the UNIVERSES, you are gonna pull me into spending in another game by the way you show how you manage this one... i mean, there's a ton of improvement and very clever game twists you can implement to keep on building hype here. There's a lot of wise idea just in this thread, and no ones here is paid to get these ideas...! imagine where it could goes!! AND!!!YOU HAVE THE FAN BASE!!!!DON'T LET US DOWN!! COZ WE WON'T FOLLOW YOU ON YOUR NEXT PROJECT!! The really interesting part of this game and the only reason why people spend crazy money on it is the long, loong term perspective it has. you have to keep us entertained! it's your job! don't we pay you well enough? NO one should feel like having to play because he (or she, don't get me wrong feminazi), has to make his money spent worth it... That's the very thing that frustrate me the most, feeling i'm slowly heading toward this: keeping on playing a game only because i spent a relatively good amount of money on it The last achievement on the list is something about paying respect 1000 days...do you have a goal concerning the number of people achieving this? could it be a community thing? In other game they have these community goals, like reach this point as a community and we implement this...thing! that would be nice! Another good idea would be to eventually implement a UE version of castleage's \"conquest\"...like a bank or respect building where empires could choose as a team to pay respect to one of the faction.. this could bring diversity in war strategies as it could gives different advantages.. and then empires could decide to attack another's building (outside of EvE) to steal a portion of that respect and to lower their advantage for the next EvE...This could bring empires to create alliances and so long (to pull down AF and RM a bit :P)...let's say once a building is attacked, you have an amount of time to bring it down before a shield is turned on anyway...just keep us entertained pls TL;DR here's a list of the stuff that frustrate me: - omakase drop rate in RDC (in my experience : 100% drop rate 100% of the time, i mean ALL THE FREAKING TIME no matter how marvelous numbers of points you reach or how many epics you drop, it's gonna be an omakase EVERY GOD DAMN TIME! ) - someone point it out : that tRolling ball of death spinning for years before you get the error time requested message... really grind my gears - the amount of good ideas i read in this forum that has not even seemed to have been considered by PA DOPE_NOSE aka EatDaPooPoo",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "It does seem like they have some really busy job that keeps them from spending more than a minimal amount of time on UWE. I look at other games and it doesn't look the same. For instance ... There are games that aren't as cool as UWE, but have lots of activity. I'm sure that there are people at PA familiar with the marketing efforts of other companies. Activision and Vicarious Visions have a Skylanders Lost Islands game, that has: * A new character in the wishing well each month. * Super Tuesday, when some feature of the game changes for the day. Double gold. Extra trolls. Just a wrinkle, just a day. * They roll new marketing every Monday. Except when it's on Tuesday. Or when they miss a week. * Something is almost always on sale, whether it's a discount on vehicles, buildings, skylanders, or shrines. Hay Day puts on a contest on Facebook each Friday, and people win in-game prizes. Real Racing 3 sends push messages to inactive players offering them in-game prizes to come back and play. My point is that other people, surely less talented and creative than PA staff, are doing things on a schedule, that make the game interesting. The timing cycles make it easy for people to say, \"I'm saving for a sale / promotion. There will be one on Tuesday / Friday and I'll get that shiny new 4-star Kate I've been wanting.\" By contrast, at UWE you find yourself looking down Dirty Harry's gun barrel. \"Do you feel lucky, punk?\" Will I buy FP today, and then tomorrow find that there was a promotion? What impact do you think that has on spending? I really like this game, but I have to agree that it feels like they aren't pedaling as fast as some of the kids at the other game companies. Perhaps there are some very reasonable historical experiences that led them to operate this game by remote control. But here's the question I keep coming back to: Why do the other game companies manage to get involved and stay involved? Why does PA choose not to do what seems to common in the industry? If I knew who to ask, I'd ask them. Here on the forums, I would generally expect some disaffected customer to say that it's because of flaws in the character of the people at PA. I refuse to believe that. The guy who designs Ferrari's wants to make a new model every 5 years, not every year. Perhaps PA wants to have the game settle out a bit between updates. (Perhaps not, I'm just trying to think of reasons why they would appear torpid.)",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page4",
        "date": "Thu, 23 Jan 2014 00:00:00 GMT"
    },                                                  
    
    
    
    {
        "text": "Perfect ideas. Hope pa listens. They are certainly ignoring the other suggestions thread in tech section.\nReally don't understand how difficult can it be to set a timed event say once a month. Eg. Arena one month which lasts 5 days. Pirate event next month again 5 days. And so on it just encourages more activity.\nAn event which places random players from all empires or even empires in eve and fighting to win based on tournament style play is another brilliant suggestion already given. So many possibilities.\nAll I see is an effort to make it look more jazzy and less substance. The skills were a good start hope the events are next. I don't care about an update that says here are the empire drops. Now go do the same thing again. I want to see an actual improvement and addition to this awesome game.\nI see other games offering the same stuff in terms of events which actually makes me go back and play them. I don't know how long I can keep playing ue any longer if this keeps up. As is the only time I am now online is during eve. Or when my friends are online.\nHave already stopped playing ca along with a lot of my other friends due to exactly the same reason. Login , burn eng and Stam in a few seconds then wait hrs till eve. Repeat. Nothing else to look forward to do in the game. No events to anticipate no good rewards to look forward to nothing. Nada.\nPlease respond devs. This is not a hate thread but an actual appeal from the forums. Call it final effort from us customers to you to actually improve conditions. We r willing are you?\nCheers to all the members who have provided actual input and not turn this into a big troll.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Seriously, if anyone has a Devs email or UE's email, ya should forward this thread! So many great ideas I'm lost and don't have anything to add, which is worrisome lol",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "With crates I reckon a good fix would be, every time you don't roll a epic your next crate roll epic win chance should go up .2% so every 5 rolls makes its 1% extra chance of a epic and keep stacking until you win one then reset back to the base 5%, I know its not a lot in the increase to win but that way wouldnt rape their profit margin and make the spenders get what they are after eventually Doomsday raise player limit to 80 at least< sick of getting boss taggers and making the people that are having a go have to put way more extra stam into a fight and go double if not triple over the thresholds",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "@sick Lol, I thought the very same thing. When Sureshoot skill came I wondered why not apply this to goodies. Great idea but the purpose of this thread is to acknowledge treatment. Still give us something when we have a dry spell. I know players that spun $700 in crates between epics @shai Yes they are reading this. I posted screenshots of them viewing this thread a few posts back @mist Totally agree with you bud. You have been here just as long as I have, if not longer. These are all very good points and suggestions. I don't feel any of us are getting hostile. Let's have someone from PA chime in please???",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by AnalOverload View Post @sick Lol, I thought the very same thing. When Sureshoot skill came I wondered why not apply this to goodies. Great idea but the purpose of this thread is to acknowledge treatment. Still give us something when we have a dry spell. I know players that spun $700 in crates between epics @shai Yes they are reading this. I posted screenshots of them viewing this thread a few posts back @mist Totally agree with you bud. You have been here just as long as I have, if not longer. These are all very good points and suggestions. I don't feel any of us are getting hostile. Let's have someone from PA chime in please??? One post of them saying hey we're reading this would probably make waves.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Just want to point out this thread is a little over 2 days old and has 85 replies and 2.5k views. Nice! But where are the devs? @Vince. I haven't seen this much action since the LT meltdown.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "First thing that comes to mind is poor, read appaling, customer service. Second is lack of overall communications. Third is that PA time and dates differ a lot from real world. This is how you can fuck up any service.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "So we pay 25$... Most ppl more to get skull king and he says 2x damage then they switch his skill to 2x stam so now he's just a weak duke???? I thought he would do 2x damage in Eve as well since that's what he said he would do in my opinion this is false advertisement and a complete lie to get ppl to purchase this LT it's fucked up and PA can either refund our money make a change to this LT to make it useful or go to hell with their riches fucking pricks",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by Espnforbes View Post So we pay 25$... Most ppl more to get skull king and he says 2x damage then they switch his skill to 2x stam so now he's just a weak duke???? I thought he would do 2x damage in Eve as well since that's what he said he would do in my opinion this is false advertisement and a complete lie to get ppl to purchase this LT it's fucked up and PA can either refund our money make a change to this LT to make it useful or go to hell with their riches fucking pricks Nowhere in the description of skull king did it say anything about EvE It clearly stated 2x stamina which is 2x damage with auto heal if money available. I saw no false advertisement",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Before I spam the s h i t outta these forums maybe someone can prevent it by understanding and answering my Q as best possible. My problem has happened to me twice in a row now. I go to load up my first scratch off and te game crashes. ( note: the scratch off does not load up for me to even hit the \"scratch all\" button ) so even if the scratch off did load up ( which didn't ! ) wouldn't have had a chance to hit the \"scratch all button\" anyways which is the purpose of getting the reward. I understand that if I did hit the \"scratch all\" button and it actually crashed right after, I would still get that reward no matter what. So my Q is: does it automatically scratch for me as well even if I crash out of the scratch off load in screen? Please someone answer me because no matter what it deducts the scratch off either way. I have not scene any evidence of rewards, no money no Lts no extra scratch offs or free refills! Ima lose my mind because no PA is answering my Q!!!!!",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by Static View Post Nowhere in the description of skull king did it say anything about EvE It clearly stated 2x stamina which is 2x damage with auto heal if money available. I saw no false advertisement Skull king clearly said x2damage when it first came out not staminiA I'm not and idiot static...I'm sure someone else noticed this too",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by Espnforbes View Post Skull king clearly said x2damage when it first came out not staminiA I'm not and idiot static...I'm sure someone else noticed this too It said 2x stamina and 2x damage. The 2x damage is because of the 2x stamina (just like duke in that regards)",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Please keep this thread for frustrations static and espn take this squabble to pms please",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by Voodoo jester View Post Please keep this thread for frustrations static and espn take this squabble to pms please I apologize! I understand the importance of this thread and don't wanna see it closed or derailed I am frustrated that both the community manager and a dev posted in another thread, but why not here? You guys really should acknowledge this thread!",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by Voodoo jester View Post Please keep this thread for frustrations static and espn take this squabble to pms please I agree. As for that promo, that's the promo. If you need to talk about it there's other threads about skull king http://i.imgur.com/chBVFbz.jpg Case closed please let's keep this thread going for what it was made to do. Still really waiting for someone from PA to respond.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "4* 5* and 6* col z and Natalia give the same bonus I've brought this up to support and only got a we'll look into it. There was no need I had sent in screen shots to back my claims 5.1%,5.6% and 6% are all treated the same... 6% you might as well make 4 and 5* 6% Then they turn and release colt, hammer, and the syndicate one, no cartel version. But the abilities basically made all other common lts useless. And last but not least since we're on the subject... No new crate yet... Here we are having had 4 events all with different epic lts... You have a couple monthly lts since you updated the old crates and some new commons... That basically means over half the crate is done for you already..",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "The amount of energy needed to complete a Dice Challenge has risen yet we're lacking a map with Two rares, and two uncommons (dice challenge drops)",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by Anthony View Post Ok here is my opinion! Yes, all the above is totally accurate! My frustration is with monitoring accounts ive stopped power lvling months ago due to that why should i pay to play when someone just uses his internet geek squad to cheat and get over on us all. I understand high lvls increase profit due to others wanting to conquer that positon of be a super lvl but i personally think they should be checking these accounts of interest weekly/monthly because idc what anyone says i know whom are cheating and why but why arent you doing anything to stop it PA? I understand ur lack of communication to us came due to the imaturity of some past forumers whom have went to far with the threats and such but to basicually let this game run its self by the user without communication baffles me please reinvest yourselves into UnderWorld Empires again like it once was!! Take care and as always God Bless!! I agree!",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "How about a LT that increases exp gained by a percentage? Or how about every $200 spent on FP you get a free 3x crate roll? How about a reward for every 10-20 call for backup you answer?",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    {
        "text": "Quote Originally Posted by Peru View Post Before I spam the s h i t outta these forums maybe someone can prevent it by understanding and answering my Q as best possible. My problem has happened to me twice in a row now. I go to load up my first scratch off and te game crashes. ( note: the scratch off does not load up for me to even hit the \"scratch all\" button ) so even if the scratch off did load up ( which didn't ! ) wouldn't have had a chance to hit the \"scratch all button\" anyways which is the purpose of getting the reward. I understand that if I did hit the \"scratch all\" button and it actually crashed right after, I would still get that reward no matter what. So my Q is: does it automatically scratch for me as well even if I crash out of the scratch off load in screen? Please someone answer me because no matter what it deducts the scratch off either way. I have not scene any evidence of rewards, no money no Lts no extra scratch offs or free refills! Ima lose my mind because no PA is answering my Q!!!!! Peru stop you're not doing this thread any good and will report you for spam",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page5",
        "date": "Fri, 24 Jan 2014 00:00:00 GMT"
    },
    
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Hello everyone,\nLets have a bit of perspective please. I believe we are responsible for the current state of affairs.\nIn the early days, we had:\n- An excellent community Manager (Airmid)\n- A few devs that were implicated in in the community and replying to our posts (Maybe too much implicated)\n- Good Game Gurus\n- Devs and PA folks that were playing the game with us.\n- Game updates every few months\n- A community of players that was really really hard to please.\nI believe this was the golden age of the forums and everything community wise.\nFrom then on, everything started to go downhill.\n- Because of a single human mistake (Airmid tested something with her UWE account and forgot to remove it), the whole community ganged up on her and forced the PA folks to stop playing UWE. (Creating distance between PA and its players)\n- Some folks deliberatly started a smear campaign against UWE and PA employees (which shall remain nameless)\n- Then the cheating scandal erupted and the s*** hit the fan.\n- The community that was hard to please became angry and violent. (OK PA fucked up, they learned from this mistake and we need to move on)\n- The forums became useless as it became a PA bash fest. (Its ok to be angry but the line was crossed and things went overboard)\n- Some folks (Nameless folks again), managed to find the real identity of Airmid and sent her life threatening messages\n- Airmid resigned or was removed from her position and never replaced\n- PA disconnected themselves from the \"angry community\" and I am sure they even thought of disabling the forums.\nThe result of all of this is the following:\n- The forums have become a focal point for a very angry and very childish community.\n- PA IS CONTINUING to release updates (if you check the calendar, they have been releasing updates every few months, this has not changed since day 1)\n- PA has disconnected themselves from the forums and community. Thank god we still have our awesome game gurus helping out.\n- Players are not happy because we get no feedback from PA.\nIn the end, we are the ones responsible... we have cut the communications lines between ourselves and PA.... and thats a shame.\nIf you WANT things to change, we, as a community, need to learn to respect each other. AND we need to start building bridges again.\nPA needs to show signs that it is still there, we can work things out but it will take time.\nWE need to take a chill pill.\nAnyways.... Just My 2 cents.\nEh. The ones who messed up the forums are the minority.\nWe pay good money (or did) to enjoy this game. No point in spending more when they are being completely classless with the complete lack of response to us.\nWE are not responsible. A FEW are/were. The rest of us are getting shafted and it's too bad. Plenty of good people on here answering questions, helping others, being polite. To be so ignored because of something that happened several months ago means my money is no good here.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "diffbotUri": "article|3|1251423123",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page7",
        "humanLanguage": "en",
        "html": "<blockquote>     Hello everyone,  Lets have a bit of perspective please. I believe we are responsible for the current state of affairs.  In the early days, we had: - An excellent community Manager (Airmid) - A few devs that were implicated in in the community and replying to our posts (Maybe too much implicated) - Good Game Gurus - Devs and PA folks that were playing the game with us. - Game updates every few months - A community of players that was really really hard to please.  I believe this was the golden age of the forums and everything community wise.  From then on, everything started to go downhill.  - Because of a single human mistake (Airmid tested something with her UWE account and forgot to remove it), the whole community ganged up on her and forced the PA folks to stop playing UWE. (Creating distance between PA and its players) - Some folks deliberatly started a smear campaign against UWE and PA employees (which shall remain nameless) - Then the cheating scandal erupted and the s*** hit the fan. - The community that was hard to please became angry and violent. (OK PA fucked up, they learned from this mistake and we need to move on) - The forums became useless as it became a PA bash fest. (Its ok to be angry but the line was crossed and things went overboard) - Some folks (Nameless folks again), managed to find the real identity of Airmid and sent her life threatening messages - Airmid resigned or was removed from her position and never replaced - PA disconnected themselves from the &quot;angry community&quot; and I am sure they even thought of disabling the forums.  The result of all of this is the following:  - The forums have become a focal point for a very angry and very childish community.  - PA IS CONTINUING to release updates (if you check the calendar, they have been releasing updates every few months, this has not changed since day 1) - PA has disconnected themselves from the forums and community. Thank god we still have our awesome game gurus helping out. - Players are not happy because we get no feedback from PA.  In the end, we are the ones responsible... we have cut the communications lines between ourselves and PA.... and thats a shame.  If you WANT things to change, we, as a community, need to learn to respect each other. AND we need to start building bridges again.  PA needs to show signs that it is still there, we can work things out but it will take time. WE need to take a chill pill.  Anyways.... Just My 2 cents.   Eh. The ones who messed up the forums are the minority.   We pay good money (or did) to enjoy this game. No point in spending more when they are being completely classless with the complete lack of response to us.  WE are not responsible. A FEW are/were. The rest of us are getting shafted and it's too bad. Plenty of good people on here answering questions, helping others, being polite. To be so ignored because of something that happened several months ago means my money is no good here. </blockquote>",
        "date": "Tue, 04 Feb 2014 00:00:00 GMT",
        "type": "article",
        "docId": 105141029074,
        "lastCrawlTimeUTC": 1401250292,
        "timestamp": "Wed, 28 May 2014 04:11:32 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Ca has gotten another promo.. This is what we talk about when we mention neglect...\n2 promos in less than a month for castle age...\nWhile how far apart are the ones here?\nCatle age just got a massive content boost to from my understanding... With the leviathans. Looks like rogue recently got 2 new skills that once again I'd like to point out\nI understand people are beginning to leave castle age.. But look at what you're doing your pissing them off with things like that... There is some good news the some or most that do leave castle age come here. I met a couple dozen last night in wc.\nSome of them even recreated guilds here:\nDe Lioncourt\nSweet revenge\nGrim death\nAfs inc (even though that was formed day 1 of us release, still started over in ca)\nIt's a matter of time before they leave ca and not play or they come here.. I/we understand that you guys are experiencing growing pains.\nThose who are skilled in combat do not become angered, those who are skilled at winning do not become afraid. Thus the wise win before the fight, while the ignorant fight to win - Zhuge Liang \"the sleeping dragon\"\nkabam needs to reach up their rectums grab ahold of their ears and pull till they can see daylight",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "diffbotUri": "article|3|1251423124",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page8",
        "images": [
            {
                "diffbotUri": "image|3|1239087267",
                "primary": true,
                "url": "http://underworldempireforums.com/image.php?s=1b751c10f58f56fe0a40aaf323527661&u=174&type=sigpic&dateline=1391463761"
            }
        ],
        "humanLanguage": "en",
        "html": "<figure><img alt=\"\" src=\"http://underworldempireforums.com/image.php?s=1b751c10f58f56fe0a40aaf323527661&u=174&type=sigpic&dateline=1391463761\"></img></figure>\n<blockquote> Ca has gotten another promo.. This is what we talk about when we mention neglect...  2 promos in less than a month for castle age...   While how far apart are the ones here?  Catle age just got a massive content boost to from my understanding... With the leviathans. Looks like rogue recently got 2 new skills that once again I'd like to point out   I understand people are beginning to leave castle age.. But look at what you're doing your pissing them off with things like that... There is some good news the some or most that do leave castle age come here. I met a couple dozen last night in wc.   Some of them even recreated guilds here:  De Lioncourt Sweet revenge Grim death Afs inc (even though that was formed day 1 of us release, still started over in ca)  It's a matter of time before they leave ca and not play or they come here.. I/we understand that you guys are experiencing growing pains. </blockquote>\n<blockquote>Those who are skilled in combat do not become angered, those who are skilled at winning do not become afraid. Thus the wise win before the fight, while the ignorant fight to win - Zhuge Liang &quot;the sleeping dragon&quot;    kabam needs to reach up their rectums grab ahold of their ears and pull till they can see daylight</blockquote>",
        "date": "Mon, 17 Feb 2014 00:00:00 GMT",
        "type": "article",
        "docId": 189533358298,
        "lastCrawlTimeUTC": 1401250292,
        "timestamp": "Wed, 28 May 2014 04:11:32 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Hey everyone,\nOkay, here's my frustrations with the game. Some may agree, some may not, but they are my frustrations.\n1: I have tried to report several bugs and issues with the game, and game play for as long as I can remember playing. Way back in the beginning you'd get a written response very quickly, often times same day. Or you could contact Airmid in game and she would have the issue resolved. Now, it takes near a week before you get the automated response \"please take a screen shot of the issue and get back to us\" - well, let me tell you, when an issue arrises during an EvE battle, the last thing on my mind is snapping a screen shot, or two... Other issues that have resulted in lost FP's, or lost stamina due to a times out attack, well for me to reproduce those issues, they are going to cost a lot of money, as it does not happen EVERY time...\n2: please listen to the community and do some investigating of issues reported instead of brushing our concerns off and signing out. By issues, I mean in game issues that are not bugs, more like harassment of any nature. Several times I have entered world chat to be bombarded with hordes of inappropriate topics and conversations that many might find offensive and border line harassment.\n3: please do not post an important update, or start an event on a Friday when you do not work on weekends to resolve issues. I know you beta test, but how many are there testing? - I guarantee it's no 10k plus people like you have who play the live model.\n4: Please review the strength of Lieutenants. This is a PvP / War game. Why is it that your battle stats almost mean nothing until you are around level 1200, then they mean everything... Because of the Lieutenants. Lower their strength by at the very least 50-75% and this will actually solve more issues then create them... Then choices of builds actually mean something. Choosing BSI or LSI, this doesn't kill LSI, it just makes their choice of game play VS PvP build more realistic. People who choose PvP build suffer the lack of game play ability (trying to get epics from bosses such as Doomsday, DragonCore, Knights Templar is virtually impossible for someone with only 240 stamina, but yet the game play build can farm his way to the very top PvP ranks... This needs to be reviewed and adjusted.\n5: crate rolls. What the heck... The other night I felt like blowing some money because I've hit a wall (so to speak) with my toon, so I decided to roll crates... 100$ later, 1 Duke, 1 Alpha, 1 Borris and a crap load of common LT's... You've got to be kidding me, right?\n6: I know communication was mentioned in issue 1, and somewhat issue 2, but those were directly related to the game and support, now this, I feel we need at least a representitive from PA acknowledging posts, providing answers and feedback, right here on the forums. I know Airmid did a fantastic job, and I know why she was removed (stepped down, call it however you want) - but there has been very little attention since that issue. I know tempers flare, and emotions get very hot when we're talking real big money investments, but guess what, every single company in the world has to deal with customer satisfaction issues all the time. There is no single company or business that can claim 100% satisfaction. You'll always have someone unsatisfied, but it's how you (PA) deal with it that makes you a strong company. Remember, you are the ones with all the power, why hide and avoid?\n7: acknowledge the people who actually work at making this a better place. The Game Guru's, posters who actually HELP the community. people who share their strategies and tricks. Each could have kept the PL guide all to himself, could have strolled right through the game. Yes, perhaps someone else MAY have posted a guide like that, but for him to take the time, and share the tricks, that in itself deserves an applause, and not only from the community, but from PA as well. Think of how many people stuck to this game by his method. Also by the way... It's not free either... That is just one example, perhaps in my mind one of the most prominent, but then you have boss guides, items guides, empire guides, the list goes on. There are people who play a game for 15 minutes, and that's their enjoyment, then you get these guys, who invest countless hours of their own time... They are the ones that keep you going. A little recognition isn't going to piss a single person here off.\nIt's very late for me, and I have a busy day tomorrow. I may add some more, as there are a few other points I want to touch on, but I have to leave it here for now.\nThanks for taking the time to read.\n-X",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "diffbotUri": "article|3|1251423118",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page2",
        "images": [
            {
                "diffbotUri": "image|3|-1740564787",
                "primary": true,
                "url": "http://underworldempireforums.com/image.php?s=9e6aefd166852d948531e115ed76e8de&u=1202&type=sigpic&dateline=1369162168"
            },
            {
                "diffbotUri": "image|3|46734767",
                "url": "http://underworldempireforums.com/image.php?s=9e6aefd166852d948531e115ed76e8de&u=1083&type=sigpic&dateline=1384741370"
            },
            {
                "diffbotUri": "image|3|-1864251332",
                "url": "http://i.imgur.com/HHQbL67.jpg"
            },
            {
                "diffbotUri": "image|3|1785711151",
                "url": "http://i.imgflip.com/2tk9l.gif"
            }
        ],
        "humanLanguage": "en",
        "html": "<figure><img alt=\"\" src=\"http://underworldempireforums.com/image.php?s=9e6aefd166852d948531e115ed76e8de&u=1202&type=sigpic&dateline=1369162168\"></img></figure>\n<figure><img alt=\"\" src=\"http://underworldempireforums.com/image.php?s=9e6aefd166852d948531e115ed76e8de&u=1083&type=sigpic&dateline=1384741370\"></img></figure>\n<figure><img alt=\"\" src=\"http://i.imgur.com/HHQbL67.jpg\"></img></figure>\n<figure><img alt=\"\" src=\"http://i.imgflip.com/2tk9l.gif\"></img></figure>\n<blockquote> Hey everyone,  Okay, here's my frustrations with the game. Some may agree, some may not, but they are my frustrations.  1: I have tried to report several bugs and issues with the game, and game play for as long as I can remember playing. Way back in the beginning you'd get a written response very quickly, often times same day. Or you could contact Airmid in game and she would have the issue resolved. Now, it takes near a week before you get the automated response &quot;please take a screen shot of the issue and get back to us&quot; - well, let me tell you, when an issue arrises during an EvE battle, the last thing on my mind is snapping a screen shot, or two... Other issues that have resulted in lost FP's, or lost stamina due to a times out attack, well for me to reproduce those issues, they are going to cost a lot of money, as it does not happen EVERY time...  2: please listen to the community and do some investigating of issues reported instead of brushing our concerns off and signing out. By issues, I mean in game issues that are not bugs, more like harassment of any nature. Several times I have entered world chat to be bombarded with hordes of inappropriate topics and conversations that many might find offensive and border line harassment.  3: please do not post an important update, or start an event on a Friday when you do not work on weekends to resolve issues. I know you beta test, but how many are there testing? - I guarantee it's no 10k plus people like you have who play the live model.  4: Please review the strength of Lieutenants. This is a PvP / War game. Why is it that your battle stats almost mean nothing until you are around level 1200, then they mean everything... Because of the Lieutenants. Lower their strength by at the very least 50-75% and this will actually solve more issues then create them... Then choices of builds actually mean something. Choosing BSI or LSI, this doesn't kill LSI, it just makes their choice of game play VS PvP build more realistic. People who choose PvP build suffer the lack of game play ability (trying to get epics from bosses such as Doomsday, DragonCore, Knights Templar is virtually impossible for someone with only 240 stamina, but yet the game play build can farm his way to the very top PvP ranks... This needs to be reviewed and adjusted.   5: crate rolls. What the heck... The other night I felt like blowing some money because I've hit a wall (so to speak) with my toon, so I decided to roll crates... 100$ later, 1 Duke, 1 Alpha, 1 Borris and a crap load of common LT's... You've got to be kidding me, right?   6: I know communication was mentioned in issue 1, and somewhat issue 2, but those were directly related to the game and support, now this, I feel we need at least a representitive from PA acknowledging posts, providing answers and feedback, right here on the forums. I know Airmid did a fantastic job, and I know why she was removed (stepped down, call it however you want) - but there has been very little attention since that issue. I know tempers flare, and emotions get very hot when we're talking real big money investments, but guess what, every single company in the world has to deal with customer satisfaction issues all the time. There is no single company or business that can claim 100% satisfaction. You'll always have someone unsatisfied, but it's how you (PA) deal with it that makes you a strong company. Remember, you are the ones with all the power, why hide and avoid?  7: acknowledge the people who actually work at making this a better place. The Game Guru's, posters who actually HELP the community. people who share their strategies and tricks. Each could have kept the PL guide all to himself, could have strolled right through the game. Yes, perhaps someone else MAY have posted a guide like that, but for him to take the time, and share the tricks, that in itself deserves an applause, and not only from the community, but from PA as well. Think of how many people stuck to this game by his method. Also by the way... It's not free either... That is just one example, perhaps in my mind one of the most prominent, but then you have boss guides, items guides, empire guides, the list goes on. There are people who play a game for 15 minutes, and that's their enjoyment, then you get these guys, who invest countless hours of their own time... They are the ones that keep you going. A little recognition isn't going to piss a single person here off.  It's very late for me, and I have a busy day tomorrow. I may add some more, as there are a few other points I want to touch on, but I have to leave it here for now.  Thanks for taking the time to read.  -X </blockquote>",
        "date": "Wed, 22 Jan 2014 00:00:00 GMT",
        "type": "article",
        "docId": 209568418044,
        "lastCrawlTimeUTC": 1401250291,
        "timestamp": "Wed, 28 May 2014 04:11:31 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "First off I don't know anything about what it takes to develop or maintain/update a game like this so in that respect thank you PA for making a great game that a lot of people are obviously passionate about.\nI also don't know what makes people spend with regards to constant new content, regular updates, events, etc. other than people pay to get better faster and to be in the elite of the game.\nThat being said I definitely have become a little disenfranchised with the game at this point. There are a ton of games that operate with a similar formula of basically, energy for jobs and stamina for battles of whatever type with the ability to upgrade as you progress in the game. Both on direct character upgrades as well as supplementary items like weapons, gear, etc.\nUE however, is the only game that's held my interest. Maybe it was the uncluttered screen, \"simple\" game mechanics, or the fact that it was more real world as opposed to ogres, elves, knights, or whatever else. I even tried CA and that didn't do it for me.\nLuckily I haven't had any real issues with the game to where I'd have to submit a support ticket so I can't comment on that side of service. But the main goal of these games is to make one that a lot of people play, and spend money on, right? I can only think that more content more regularly would accomplish this. If I was a big spender (which I'm not having only spent $80) and I'm level 1K plus with all jobs complete and rank 24 with a gaggle of nice LTs what is there for me to spend on. But if you release new LTs or a new map or something else I would prob spend to get it or finish it first but who knows.\nThe issue I have is that it doesn't seem like this new content is that much work (again I have no real idea) but to put up new artwork for an LT give them a name and a power....or for a new map and jobs that's gotta be simple enough. The thing that really gets me is a lot of the creative thinking needed has been done by members of the forums. I have seen numerous great ideas (and some crappy ones) to update every facet of this game. All that's needed is maybe a little tweak and to put it in game.\nAgain I have no real concept of the work involved or how the monetary system works on a game like this bit I would have to think more stuff/areas (as long as the game doesn't become extremely complicated) would be good for the bottom line.\nAll in all this is a great game. I just hope that PA hasn't put this game on the back burner because of the whole cheating scandal or something. Or maybe there is a major game design flaw that can't be managed around. Who knows.\nThere is a great community here PA that loves your game and would be happy to contribute (money, ideas, etc) to keep this thing going strong. I think what the players want more than anything else (at least I do) is a commitment from you that you're still dedicated to this game and will hold up your side of the deal. As was said above...it's when the players go silent that you really have to worry.",
        "title": "Re: Frustrations with pa's treatment of game and forum",
        "diffbotUri": "article|3|1251423122",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/page6",
        "humanLanguage": "en",
        "html": "<li>      <blockquote> First off I don't know anything about what it takes to develop or maintain/update a game like this so in that respect thank you PA for making a great game that a lot of people are obviously passionate about.   I also don't know what makes people spend with regards to constant new content, regular updates, events, etc. other than people pay to get better faster and to be in the elite of the game.   That being said I definitely have become a little disenfranchised with the game at this point. There are a ton of games that operate with a similar formula of basically, energy for jobs and stamina for battles of whatever type with the ability to upgrade as you progress in the game. Both on direct character upgrades as well as supplementary items like weapons, gear, etc.   UE however, is the only game that's held my interest. Maybe it was the uncluttered screen, &quot;simple&quot; game mechanics, or the fact that it was more real world as opposed to ogres, elves, knights, or whatever else. I even tried CA and that didn't do it for me.   Luckily I haven't had any real issues with the game to where I'd have to submit a support ticket so I can't comment on that side of service. But the main goal of these games is to make one that a lot of people play, and spend money on, right? I can only think that more content more regularly would accomplish this. If I was a big spender (which I'm not having only spent $80) and I'm level 1K plus with all jobs complete and rank 24 with a gaggle of nice LTs what is there for me to spend on. But if you release new LTs or a new map or something else I would prob spend to get it or finish it first but who knows.   The issue I have is that it doesn't seem like this new content is that much work (again I have no real idea) but to put up new artwork for an LT give them a name and a power....or for a new map and jobs that's gotta be simple enough. The thing that really gets me is a lot of the creative thinking needed has been done by members of the forums. I have seen numerous great ideas (and some crappy ones) to update every facet of this game. All that's needed is maybe a little tweak and to put it in game.   Again I have no real concept of the work involved or how the monetary system works on a game like this bit I would have to think more stuff/areas (as long as the game doesn't become extremely complicated) would be good for the bottom line.   All in all this is a great game. I just hope that PA hasn't put this game on the back burner because of the whole cheating scandal or something. Or maybe there is a major game design flaw that can't be managed around. Who knows.   There is a great community here PA that loves your game and would be happy to contribute (money, ideas, etc) to keep this thing going strong. I think what the players want more than anything else (at least I do) is a commitment from you that you're still dedicated to this game and will hold up your side of the deal. As was said above...it's when the players go silent that you really have to worry. </blockquote>        </li>",
        "date": "Mon, 27 Jan 2014 00:00:00 GMT",
        "type": "article",
        "docId": 228779935963,
        "lastCrawlTimeUTC": 1401250292,
        "timestamp": "Wed, 28 May 2014 04:11:32 GMT"
    },
    {
        "icon": "http://underworldempireforums.com/favicon.ico",
        "text": "Hi everyone, ok so I know you're all frustrated with things. I'm making this thread for you to illustrate said frustrations and to ask questions...\nPlease keep these to constructive criticism and questions... The purpose of this thread is to ILLUSTRATE our frustrations and ask questions...\nIf someone's question or frustration can be answered by yourself or another player please handle it in a pm not here. Also serious questions so I'll start and illustrate it what I mean by serious questions.\nMy frustrations are as follows, serious abuse of forums, lack of troll control (Theroux case and point, thanks matt for handling that) but by far my biggest frustration is as follows.. Hardcore lack of communication.\nWhy is it the ca players know what the event rewards are stats included well before the event starts and we here at ue get the shaft?\nSo I got the ball rolling people please keep it rolling.. We want pa to see our issues with them. The message is to illustrate frustration not illustrate we're coming after you remember that thank you",
        "title": "Frustrations with pa's treatment of game and forum",
        "diffbotUri": "article|3|358818069",
        "pageUrl": "http://www.underworldempireforums.com/showthread.php?7390-Frustrations-with-pa-s-treatment-of-game-and-forum/",
        "humanLanguage": "en",
        "html": "<li>      <blockquote> Hi everyone, ok so I know you're all frustrated with things. I'm making this thread for you to illustrate said frustrations and to ask questions...  Please keep these to constructive criticism and questions... The purpose of this thread is to ILLUSTRATE our frustrations and ask questions...   If someone's question or frustration can be answered by yourself or another player please handle it in a pm not here. Also serious questions so I'll start and illustrate it what I mean by serious questions.    My frustrations are as follows, serious abuse of forums, lack of troll control (Theroux case and point, thanks matt for handling that) but by far my biggest frustration is as follows.. Hardcore lack of communication.  Why is it the ca players know what the event rewards are stats included well before the event starts and we here at ue get the shaft?      So I got the ball rolling people please keep it rolling.. We want pa to see our issues with them. The message is to illustrate frustration not illustrate we're coming after you remember that thank you </blockquote>        </li>",
        "date": "Wed, 22 Jan 2014 00:00:00 GMT",
        "type": "article",
        "docId": 201994258639,
        "lastCrawlTimeUTC": 1401249806,
        "timestamp": "Wed, 28 May 2014 04:03:26 GMT"
    }
]
