[
 {"text":"Thanks for replying. Yes my alt is level 150 and he finally worked its way up to 501 allies. I collected the achievement bonus but when i went to put a new LT on the chair it still display as \"locked\" and i need \"500 allies and previous seat\" (already have 4 seated lieutenants at the moment). Tried to close the app, going to delete it and try re installing it and see if it helps.\nAm having problems with the collect timer and also notifications.\nSince the problem that was the daylight saving issue I've not had a single push notification to my iPhone and the collect timer on wars doesn't auto-collect. This means I'm losing out on class coins as I can't always keep in contact with the war and also I don't get reminders about what's happening in the game.\nI've logged out, re-installed an rebooted the phone but no change so far. Any ideas?\nPlease fix the purchase of FP issue. People aren't getting credited their FP.\nAlso, yesterday I Purchased the $4.99 FP and it gave me the blank box window again. (same as when u aren't credited) Well guess where I found my 30FP ? The game had purchased me a 1 crate roll.:confused: That's not where I intended to use my FP, but to save myself the hassle of contacting support about It, just rolled the damn thing.\nAlso contacted support 5 days ago about not crediting me $19.99 package. They instructed me to send them an email with the receipt. I replied to that email with the receipt and still have not received a reply nor credited. This sucks.\nAm having problems with the collect timer and also notifications.\nSince the problem that was the daylight saving issue I've not had a single push notification to my iPhone and the collect timer on wars doesn't auto-collect. This means I'm losing out on class coins as I can't always keep in contact with the war and also I don't get reminders about what's happening in the game.\nI've logged out, re-installed an rebooted the phone but no change so far. Any ideas?\nSame problem. Auto-collect is not working. I join wars on my smoking breaks and cannot collect after war. The pop-up of auto-collect never shows up and I lose the class coins and XP. Not the first time, actually it's happening every time I don't collect manually!\nI'm having issues with the update 1.6.1 keeps crashing and scince I did this update all apps on my device crash as soon I log In to eny other app and this app not happy as I would normally spend up to 7 plus hours a day on this game doing boss fights jobs and EvE and a few of the other players within the empire I'm in this same thing is happening my code FCE7C6 I've even reinstalling app still same issues\nMany people (including myself) are having the same issues. We deduced that 1.61 is not able to run on legacy devices that have iOS 4 / 5. As we aren't able to update past this point because of legacy hardware, we're basically stuck in the mud. 1.60 worked fine until the new update.\nHere's the thread that was started a couple of days ago. Many people are still experiencing problems, even after continued installing and re-installing, hard/soft resets, and constant shouting!\nhttp://underworldempireforums.com/sh...causes-crashes\n- rayryeng.","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|-1239798241","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=12","humanLanguage":"en","html":"<ul> <li>  <blockquote>Thanks for replying. Yes my alt is level 150 and he finally worked its way up to 501 allies. I collected the achievement bonus but when i went to put a new LT on the chair it still display as &quot;locked&quot; and i need &quot;500 allies and previous seat&quot; (already have 4 seated lieutenants at the moment). Tried to close the app, going to delete it and try re installing it and see if it helps.<\/blockquote>  <\/li><li>  <blockquote>Am having problems with the collect timer and also notifications.  Since the problem that was the daylight saving issue I've not had a single push notification to my iPhone and the collect timer on wars doesn't auto-collect. This means I'm losing out on class coins as I can't always keep in contact with the war and also I don't get reminders about what's happening in the game.  I've logged out, re-installed an rebooted the phone but no change so far. Any ideas?<\/blockquote>  <\/li><li>  <blockquote>Please fix the purchase of FP issue. People aren't getting credited their FP.   Also, yesterday I Purchased the $4.99 FP and it gave me the blank box window again. (same as when u aren't credited) Well guess where I found my 30FP ? The game had purchased me a 1 crate roll.:confused: That's not where I intended to use my FP, but to save myself the hassle of contacting support about It, just rolled the damn thing.  Also contacted support 5 days ago about not crediting me $19.99 package. They instructed me to send them an email with the receipt. I replied to that email with the receipt and still have not received a reply nor credited. This sucks.<\/blockquote>  <\/li><li>  <blockquote>   Am having problems with the collect timer and also notifications.  Since the problem that was the daylight saving issue I've not had a single push notification to my iPhone and the collect timer on wars doesn't auto-collect. This means I'm losing out on class coins as I can't always keep in contact with the war and also I don't get reminders about what's happening in the game.  I've logged out, re-installed an rebooted the phone but no change so far. Any ideas?   Same problem. Auto-collect is not working. I join wars on my smoking breaks and cannot collect after war. The pop-up of auto-collect never shows up and I lose the class coins and XP. Not the first time, actually it's happening every time I don't collect manually!<\/blockquote>  <\/li><li>  <blockquote>I'm having issues with the update 1.6.1 keeps crashing and scince I did this update all apps on my device crash as soon I log In to eny other app and this app not happy as I would normally spend up to 7 plus hours a day on this game doing boss fights jobs and EvE and a few of the other players within the empire I'm in this same thing is happening my code FCE7C6 I've even reinstalling app still same issues<\/blockquote>  <\/li><li>  <blockquote>Many people (including myself) are having the same issues. We deduced that 1.61 is not able to run on legacy devices that have iOS 4 / 5. As we aren't able to update past this point because of legacy hardware, we're basically stuck in the mud. 1.60 worked fine until the new update.  Here's the thread that was started a couple of days ago. Many people are still experiencing problems, even after continued installing and re-installing, hard/soft resets, and constant shouting!  <a href=\"http://underworldempireforums.com/showthread.php?6530-New-update-causes-crashes\">http://underworldempireforums.com/sh...causes-crashes<\/a>  - rayryeng.<\/blockquote>  <\/li> <\/ul>","date":"Tue, 08 Oct 2013 21:13:00 GMT","type":"article","docId":37964679415,"lastCrawlTimeUTC":1401248420,"timestamp":"Wed, 28 May 2014 03:40:20 GMT"}
,
 {"text":"Why is it that almost every time I created a boss fight, while the option for public and empire turned OFF, random people can still join the fight? I like to 1st rack up some points to get to the threshold needed but with some high level players suddenly joins it was over very fast, sometimes with 70-80 hours left on the clock. Couldn't this be fixed or something? Like the creator can put up a message so anyone can read it before they join the fight like 'attack all you want, but leave the executions to me\" or '3 star achievements for everyone, lets raise hell' and such.\nWhy is it that almost every time I created a boss fight, while the option for public and empire turned OFF, random people can still join the fight? I like to 1st rack up some points to get to the threshold needed but with some high level players suddenly joins it was over very fast, sometimes with 70-80 hours left on the clock. Couldn't this be fixed or something? Like the creator can put up a message so anyone can read it before they join the fight like 'attack all you want, but leave the executions to me\" or '3 star achievements for everyone, lets raise hell' and such.\nThis boss going public bug is known - devs are still working on a fix.","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101178","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=8","humanLanguage":"en","html":"<ul> <li>  <blockquote>Why is it that almost every time I created a boss fight, while the option for public and empire turned OFF, random people can still join the fight? I like to 1st rack up some points to get to the threshold needed but with some high level players suddenly joins it was over very fast, sometimes with 70-80 hours left on the clock. Couldn't this be fixed or something? Like the creator can put up a message so anyone can read it before they join the fight like 'attack all you want, but leave the executions to me&quot; or '3 star achievements for everyone, lets raise hell' and such.<\/blockquote>  <\/li><li>  <blockquote>   Why is it that almost every time I created a boss fight, while the option for public and empire turned OFF, random people can still join the fight? I like to 1st rack up some points to get to the threshold needed but with some high level players suddenly joins it was over very fast, sometimes with 70-80 hours left on the clock. Couldn't this be fixed or something? Like the creator can put up a message so anyone can read it before they join the fight like 'attack all you want, but leave the executions to me&quot; or '3 star achievements for everyone, lets raise hell' and such.   This boss going public bug is known - devs are still working on a fix.<\/blockquote>  <\/li> <\/ul>","date":"Tue, 02 Jul 2013 18:16:00 GMT","type":"article","docId":42680289495,"lastCrawlTimeUTC":1401248417,"timestamp":"Wed, 28 May 2014 03:40:17 GMT"}
,
 {"text":"Hello, I have multiple bugs that I would like to address:\nFirst off, I constantly get the error message \"A stronger internet connection is require to play Underworld\" every time I re-open the app. This has persisted for nearly a week and I am constantly in my house with \"3 bars\" of wifi signal and have had no wifi issues with anything. The game still works after I press \"Okay\" it is just annoying to have to press it every time.\nNext, just a small bug in the \"Create Boss\" screen. When I press on a boss and then press the \"Ingredient\" to summon them, it always says I am missing the ingredients now, instead of opening a page of whatever the item is, \"Ie, Police Cellphone\" or whatever it is called. This is regardless of owning the item or not. Also the \"Ask for Items\" button doesn't do anything of course and may be misguiding to newer players who are unaware it does not work.\nFurthermore, getting hit by a player while I have the App open does not seem to notify me with a notification in the news bar. Of course, it shows when I press \"News\" but there is no red \"1\" that appears to inform me.\nAnd, when adding an ally from the news page, another notification pops up after about a minute confirming you have added them, which is rather redundant as it already says you have added them when you accept the request.\nAlso, the app notifications regarding paying respect, a boss is killed, empire is in battle, etc, are all extremely delayed and are overall not very useful.\nI know this is a bug and issue thread, but I figured I would add in a small suggestion of being able to copy and paste messages. This is mostly for the in-game function of adding boss codes and/or ally codes.\nOverall, keep up the good work, these are just small nit picky things! Thanks!","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|-1239798242","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=11","humanLanguage":"en","html":"<blockquote>Hello, I have multiple bugs that I would like to address:  First off, I constantly get the error message &quot;A stronger internet connection is require to play Underworld&quot; every time I re-open the app. This has persisted for nearly a week and I am constantly in my house with &quot;3 bars&quot; of wifi signal and have had no wifi issues with anything. The game still works after I press &quot;Okay&quot; it is just annoying to have to press it every time.   Next, just a small bug in the &quot;Create Boss&quot; screen. When I press on a boss and then press the &quot;Ingredient&quot; to summon them, it always says I am missing the ingredients now, instead of opening a page of whatever the item is, &quot;Ie, Police Cellphone&quot; or whatever it is called. This is regardless of owning the item or not. Also the &quot;Ask for Items&quot; button doesn't do anything of course and may be misguiding to newer players who are unaware it does not work.  Furthermore, getting hit by a player while I have the App open does not seem to notify me with a notification in the news bar. Of course, it shows when I press &quot;News&quot; but there is no red &quot;1&quot; that appears to inform me.  And, when adding an ally from the news page, another notification pops up after about a minute confirming you have added them, which is rather redundant as it already says you have added them when you accept the request.  Also, the app notifications regarding paying respect, a boss is killed, empire is in battle, etc, are all extremely delayed and are overall not very useful.  I know this is a bug and issue thread, but I figured I would add in a small suggestion of being able to copy and paste messages. This is mostly for the in-game function of adding boss codes and/or ally codes.  Overall, keep up the good work, these are just small nit picky things! Thanks!<\/blockquote>","date":"Mon, 19 Aug 2013 15:25:00 GMT","type":"article","docId":91546224867,"lastCrawlTimeUTC":1401248417,"timestamp":"Wed, 28 May 2014 03:40:17 GMT"}
,
 {"text":"So... What is so complicated about removing v1.61 from the app store and reposting v1.60????? Do I honestly need to wait around for the entire reprogramming process?\nBug/ crap fix?\nDynamite hits no longer qualify for best damage reward in EvE matches, utterly stupid if this is a fix as heavys are proper shafted for extra cc in battles as it is with poorest chances in all but demo category.\nCome on devs sort yourselves out.\nPurchase + Download\n0409be army code\n3:00pm PST\nno ss\nI made a 5 dollar purchase and the game forced me to check credit card information. After checking it the purchase confirmed. I logged in and my tokens weren't on my game but I checked my bank and it was deducted from my card. so I clicked the 5 dollar fAvor point package again and it said \"Already purchased not yet downloaded\". so I tried closing the game a bunch of times but to no avail. So I got off for a few mins and tried again but still nothing. So then I deleted the game and was going to attempt to redownload it and upon download it requested my credit card info and since there's no more money on it, it wouldn't accept the card and on top of that wouldn't let me download underworld empire.\nDidn't see it listed: when you promote an officer to underboss there is a glitch that the underboss shows up at the leader of the empire. This needs to be corrected ASAP\nI made a 5 dollar purchase and the game forced me to check credit card information. After checking it the purchase confirmed. I logged in and my tokens weren't on my game but I checked my bank and it was deducted from my card. so I clicked the 5 dollar fAvor point package again and it said \"Already purchased not yet downloaded\". so I tried closing the game a bunch of times but to no avail. So I got off for a few mins and tried again but still nothing. So then I deleted the game and was going to attempt to redownload it and upon download it requested my credit card info and since there's no more money on it, it wouldn't accept the card and on top of that wouldn't let me download underworld empire.\nThe same thing happened to me but i didn't do go as far as you did. I just kept spent my stamina and went about my day. When I logged back on for the next war, boom, there it was my $20 worth of favor points. Should of waited, big dog.\nIssue Category - Purchase\nArmy Code - ????\nTime - 1/7/2014\nScreen Shot - N/A\nIssue Description - I made about 5 purchases. I did not get my tokens or whatever they are called. I got 1 refund by apple. But I want the rest refunded back to me. I know I did not charge for them and I never recieved them to begin with. And now my debit card is being rejected by apple. It has been about 3 weeks since the \"purchase\".\nI would like to be contacted by your sales department ASAP.\nDon't know if bug or change but the last battle I was in I used flamethrower on the third player in a row and it hit the guy to the left of him and the first guy in the row below. The player in position 1 of attacked building was already dead don't know if that was why or if its same prob as earlier on in game\nIssue- purchase\nAlly code- 90328A\nTime- 2/15/14 at about 8pm\nMy purchase of 19.99$ and 4.99$ favor points pack failed. And I didn't receive any favor points or the special reward for purchasing 125+ favor points. Even tho my purchase failed and didn't give me any favor points it still took money from my apple account! I try to contact underworld empire support by email but no response. Please look in to the problem I also have my iTunes account receipt that I have sent underworld empire support by email.\nI just had an issue with my empire chat being replaced with World Chat making it very difficult when EvE battles were going on. I switched empires and it was corrected. My new issue is that I can not click on my News. The other day the Holiday Rumble came up and awarded me Favor Points (12) I believe, and full stam, energy, health, changed my class from heavy to enforcer, and changed my quote in profile. I am not sure what is going on but it something is not right. Please help or can someone direct me to help??? Thanks :D\nThank you for all the things that you have done. But this is the second time that I have complained about this problem the game crashed on me last week at a very bad time I had some luck on the Lady Luck scratch and won a 1* Epic. the game took me back to my log in I loged in an no scratch no prize or anything how to we go about fixing this problem.","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|-1239798240","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=13","humanLanguage":"en","html":"<ul> <li>  <blockquote>So... What is so complicated about removing v1.61 from the app store and reposting v1.60????? Do I honestly need to wait around for the entire reprogramming process?<\/blockquote>  <\/li><li>  <blockquote>Bug/ crap fix?  Dynamite hits no longer qualify for best damage reward in EvE matches, utterly stupid if this is a fix as heavys are proper shafted for extra cc in battles as it is with poorest chances in all but demo category.  Come on devs sort yourselves out.<\/blockquote>  <\/li><li>  <blockquote>Purchase + Download  0409be army code 3:00pm PST  no ss   I made a 5 dollar purchase and the game forced me to check credit card information. After checking it the purchase confirmed. I logged in and my tokens weren't on my game but I checked my bank and it was deducted from my card. so I clicked the 5 dollar fAvor point package again and it said &quot;Already purchased not yet downloaded&quot;. so I tried closing the game a bunch of times but to no avail. So I got off for a few mins and tried again but still nothing. So then I deleted the game and was going to attempt to redownload it and upon download it requested my credit card info and since there's no more money on it, it wouldn't accept the card and on top of that wouldn't let me download underworld empire.<\/blockquote>  <\/li><li>  <blockquote>Didn't see it listed: when you promote an officer to underboss there is a glitch that the underboss shows up at the leader of the empire. This needs to be corrected ASAP<\/blockquote>  <\/li><li>  <blockquote>   I made a 5 dollar purchase and the game forced me to check credit card information. After checking it the purchase confirmed. I logged in and my tokens weren't on my game but I checked my bank and it was deducted from my card. so I clicked the 5 dollar fAvor point package again and it said &quot;Already purchased not yet downloaded&quot;. so I tried closing the game a bunch of times but to no avail. So I got off for a few mins and tried again but still nothing. So then I deleted the game and was going to attempt to redownload it and upon download it requested my credit card info and since there's no more money on it, it wouldn't accept the card and on top of that wouldn't let me download underworld empire.   The same thing happened to me but i didn't do go as far as you did. I just kept spent my stamina and went about my day. When I logged back on for the next war, boom, there it was my $20 worth of favor points. Should of waited, big dog.<\/blockquote>  <\/li><li>  <blockquote>Issue Category - Purchase Army Code - ???? Time - 1/7/2014 Screen Shot - N/A Issue Description - I made about 5 purchases. I did not get my tokens or whatever they are called. I got 1 refund by apple. But I want the rest refunded back to me. I know I did not charge for them and I never recieved them to begin with. And now my debit card is being rejected by apple. It has been about 3 weeks since the &quot;purchase&quot;.  I would like to be contacted by your sales department ASAP.<\/blockquote>  <\/li><li>  <blockquote>Don't know if bug or change but the last battle I was in I used flamethrower on the third player in a row and it hit the guy to the left of him and the first guy in the row below. The player in position 1 of attacked building was already dead don't know if that was why or if its same prob as earlier on in game<\/blockquote>  <\/li><li>  <blockquote>Issue- purchase Ally code- 90328A Time- 2/15/14 at about 8pm My purchase of 19.99$ and 4.99$ favor points pack failed. And I didn't receive any favor points or the special reward for purchasing 125+ favor points. Even tho my purchase failed and didn't give me any favor points it still took money from my apple account! I try to contact underworld empire support by email but no response. Please look in to the problem I also have my iTunes account receipt that I have sent underworld empire support by email.<\/blockquote>  <\/li><li>  <blockquote>I just had an issue with my empire chat being replaced with World Chat making it very difficult when EvE battles were going on. I switched empires and it was corrected. My new issue is that I can not click on my News. The other day the Holiday Rumble came up and awarded me Favor Points (12) I believe, and full stam, energy, health, changed my class from heavy to enforcer, and changed my quote in profile. I am not sure what is going on but it something is not right. Please help or can someone direct me to help??? Thanks :D<\/blockquote>  <\/li><li>  <blockquote>Thank you for all the things that you have done. But this is the second time that I have complained about this problem the game crashed on me last week at a very bad time I had some luck on the Lady Luck scratch and won a 1* Epic. the game took me back to my log in I loged in an no scratch no prize or anything how to we go about fixing this problem.<\/blockquote>  <\/li> <\/ul>","date":"Tue, 10 Dec 2013 22:56:00 GMT","type":"article","docId":99164653785,"lastCrawlTimeUTC":1401248419,"timestamp":"Wed, 28 May 2014 03:40:19 GMT"}
,
 {"text":"Has anyone mentioned the chat bugs yet? Sometimes when you try to backspace it jumps the cursor way back to the very first word you typed. Also sometimes chat cuts off the last word or two that you type. Pretty frustrating when you chat a lot.\nHad a bug in war yesterday with cripples.\nEnforcer, that had juggernaut (+2000hp).\nUsed cripple on him (3780hp/3900). I wasn't dead, made only 188 damages.\nAlso, the points show correctly but are halfed when added. (Only 80/120pts instead of 160/240).\nYour name can only be so many characters in length, and those special characters are each counting for several normal ones. The renaming screen is not informing you in advance that your name will be truncated, but it will if your name is that long and it contains special characters\nlol, don't know if you meant to do it, but I see what you did there, cutting off the end of your sentence xD\nThere's this guy in the commission empire, lvl 220+, using a 2 star Natalia, everytime I tap to see his profile the game boots me out. Everytime. I can see the profiles of other members of the empire just fine. Is this some sort of hack to block people from seeing your profile?\nIssue Category - Graphics\nArmy Code - ACF192\nTime -\nScreen Shot -\nIssue Description -\nI recently transfered my character from an iPhone to another iPhone. After the transfer, a lot of pictures are missing. Many Lt's, weapons, main-screen buttons, and at least one \"Jobs\" map are blank. All buttons missing their pics work fine except for the Jobs map. It doesn't work at all.\nThis seems similar to the bug that was reported in February (#135 or so in this thread). There was no resolution posted for the earlier bug.\nThank you\nIssue Category - Graphics\nArmy Code - ACF192\nTime -\nScreen Shot -\nIssue Description -\nI recently transfered my character from an iPhone to another iPhone. After the transfer, a lot of pictures are missing. Many Lt's, weapons, main-screen buttons, and at least one \"Jobs\" map are blank. All buttons missing their pics work fine except for the Jobs map. It doesn't work at all.\nThis seems similar to the bug that was reported in February (#135 or so in this thread). There was no resolution posted for the earlier bug.\nThank you\nReinstall the game, it should fix the problem\nNot sure if this is already posted.\nIf ripping to the cartel then the achieve for paying respect only increases by one every two days...surely it should be every day like the other factions? Big disadvantage to those of doing cartel, I've done from 0 to 6000 rep and been paying respect since then to cartel so I'm probably like 20 respect achieve points missing.\nI agree cartel should count twice for the achievement becuase of the way its handled","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|-1239798243","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=10","humanLanguage":"en","html":"<ul> <li>  <blockquote>Has anyone mentioned the chat bugs yet? Sometimes when you try to backspace it jumps the cursor way back to the very first word you typed. Also sometimes chat cuts off the last word or two that you type. Pretty frustrating when you chat a lot.<\/blockquote>  <\/li><li>  <blockquote>Had a bug in war yesterday with cripples.  Enforcer, that had juggernaut (+2000hp).  Used cripple on him (3780hp/3900). I wasn't dead, made only 188 damages.  Also, the points show correctly but are halfed when added. (Only 80/120pts instead of 160/240).<\/blockquote>  <\/li><li>  <blockquote>   Your name can only be so many characters in length, and those special characters are each counting for several normal ones. The renaming screen is not informing you in advance that your name will be truncated, but it will if your name is that long and it contains special characters   lol, don't know if you meant to do it, but I see what you did there, cutting off the end of your sentence xD<\/blockquote>  <\/li><li>  <blockquote>There's this guy in the commission empire, lvl 220+, using a 2 star Natalia, everytime I tap to see his profile the game boots me out. Everytime. I can see the profiles of other members of the empire just fine. Is this some sort of hack to block people from seeing your profile?<\/blockquote>  <\/li><li>  <blockquote>Issue Category - Graphics Army Code - ACF192 Time - Screen Shot -  Issue Description -  I recently transfered my character from an iPhone to another iPhone. After the transfer, a lot of pictures are missing. Many Lt's, weapons, main-screen buttons, and at least one &quot;Jobs&quot; map are blank. All buttons missing their pics work fine except for the Jobs map. It doesn't work at all. This seems similar to the bug that was reported in February (#135 or so in this thread). There was no resolution posted for the earlier bug.  Thank you<\/blockquote>  <\/li><li>  <blockquote>   Issue Category - Graphics Army Code - ACF192 Time - Screen Shot -  Issue Description -  I recently transfered my character from an iPhone to another iPhone. After the transfer, a lot of pictures are missing. Many Lt's, weapons, main-screen buttons, and at least one &quot;Jobs&quot; map are blank. All buttons missing their pics work fine except for the Jobs map. It doesn't work at all. This seems similar to the bug that was reported in February (#135 or so in this thread). There was no resolution posted for the earlier bug.  Thank you   Reinstall the game, it should fix the problem<\/blockquote>  <\/li><li>  <blockquote>   Not sure if this is already posted.  If ripping to the cartel then the achieve for paying respect only increases by one every two days...surely it should be every day like the other factions? Big disadvantage to those of doing cartel, I've done from 0 to 6000 rep and been paying respect since then to cartel so I'm probably like 20 respect achieve points missing.   I agree cartel should count twice for the achievement becuase of the way its handled<\/blockquote>  <\/li> <\/ul>","date":"Thu, 18 Jul 2013 05:05:00 GMT","type":"article","docId":121157667052,"lastCrawlTimeUTC":1401248417,"timestamp":"Wed, 28 May 2014 03:40:17 GMT"}
,
 {"text":"Game Bug and Issue Thread!\nWe, the Underworld Empire Team, are always looking for ways to improve our product. One way you can help us to do so is to report bugs and common issues you have found while playing the game.\nBefore you post, Please check our System Requirements.\nFeel free to post the issues you find below using the following format:\nIssue Category - (Download, Purchase, Connection, Gameplay)\n(Time, Time Zone and Date)\n(if possible)\nIssue Description -\nWe want to insure you have the best experience possible while playing Underworld Empire!\nIf you have a more personal or larger issue, please contact out Support Team at support.underworld@phoenixage.com\nWhat has been address on this thread so far:\nItems that have already been fixed: Boss Collection\nExecution Progress\nRespect Reseting\nEmpire Leader List Rubberbanding Issue\nWall Overload Issue(s)\nRe-assignment of Lieutenants\nCrashes and Timing Out (Memory Leakage)\nBoss Disappearance\nSwitching Between Bosses\nRepeat Action during Boss Fights\nExecution Buffs\nPush Notifications\nEmpire Boss Leaderboards\nAwarded Lieutenant(s)\nLieutenant Leveling System\nPenelope's Ability Power\nAffiliation Incorrect Showing\nSummoning Italy Boss\nBanking Load - Unable to Leave\nTypos found in random areas\nWeapons Purchase\nViewing Players in Empire\nEpic Threshold for Phoenix Boss\nEnforcers should give the same (or close to) contribution as killing an assasing for the same amount of stamina\nReplying to Post(s) Crash\nDaily Reward(s)\nEmpire Battle(s) Auto Collect\nEmpire Battle Class Abilities\nWorking as Intended: Allies being able to attack Allies\nNon-Unique User Names In-Game\nHeath Jumps when attacked in Hospital\nDuke's Ability Power - While equipped, Power Attacks now use X times the Stamina and damage is increased by X times.\nCost of Challenge Jobs\nBeing Unable to See Diamond in Tech Lab until Level 100\nCharmaine's Ability Power\nGifting\nCenturion's Health Bonus - Must be equipped before Empire Wars begin\nIssues Developers are Currently Looking Into or Partially Fixed: Properties and LT Abilities Check\nPending Request(s) in Empire(s)\nBosses going Public\nLifetime boss points for Empire(s)\nFlame Thrower Ability","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101171","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=1","humanLanguage":"en","html":"<blockquote><u>Game Bug and Issue Thread!<\/u>   We, the Underworld Empire Team, are always looking for ways to improve our product. One way you can help us to do so is to report bugs and common issues you have found while playing the game.   Before you post, Please check our <a href=\"http://underworldempireforums.com/showthread.php?945-Information-System-Requirements&p=996#post996\"> System Requirements<\/a>.  Feel free to post the issues you find below using the following format:   Issue Category - (Download, Purchase, Connection, Gameplay)  (Time, Time Zone and Date)  (if possible) Issue Description -  We want to insure you have the best experience possible while playing Underworld Empire!   If you have a more personal or larger issue, please contact out Support Team at <a href=\"mailto:support.underworld@phoenixage.com\">support.underworld@phoenixage.com<\/a>   <u><b>What has been address on this thread so far: <\/b><\/u>  <b>Items that have already been fixed<\/b>: <ul><li> Boss Collection<\/li><li> Execution Progress<\/li><li> Respect Reseting<\/li><li> Empire Leader List Rubberbanding Issue<\/li><li> Wall Overload Issue(s)<\/li><li> Re-assignment of Lieutenants<\/li><li> Crashes and Timing Out (Memory Leakage)<\/li><li> Boss Disappearance<\/li><li> Switching Between Bosses<\/li><li> Repeat Action during Boss Fights<\/li><li> Execution Buffs<\/li><li> Push Notifications<\/li><li> Empire Boss Leaderboards<\/li><li> Awarded Lieutenant(s)<\/li><li> Lieutenant Leveling System<\/li><li> Penelope's Ability Power<\/li><li> Affiliation Incorrect Showing<\/li><li> Summoning Italy Boss<\/li><li> Banking Load - Unable to Leave<\/li><li> Typos found in random areas<\/li><li> Weapons Purchase<\/li><li> Viewing Players in Empire<\/li><li> Epic Threshold for Phoenix Boss<\/li><li> Enforcers should give the same (or close to) contribution as killing an assasing for the same amount of stamina<\/li><li> Replying to Post(s) Crash<\/li><li> Daily Reward(s)<\/li><li> Empire Battle(s) Auto Collect<\/li><li> Empire Battle Class Abilities<\/li><\/ul>  <b>Working as Intended:<\/b> <ul><li> Allies being able to attack Allies<\/li><li> Non-Unique User Names In-Game<\/li><li> Heath Jumps when attacked in Hospital<\/li><li> Duke's Ability Power - While equipped, Power Attacks now use X times the Stamina and damage is increased by X times.<\/li><li> Cost of Challenge Jobs<\/li><li> Being Unable to See Diamond in Tech Lab until Level 100<\/li><li> Charmaine's Ability Power<\/li><li> Gifting<\/li><li> Centurion's Health Bonus - Must be equipped before Empire Wars begin<\/li><\/ul>  <b>Issues Developers are Currently Looking Into or Partially Fixed<\/b>: <ul><li> Properties and LT Abilities Check<\/li><li> Pending Request(s) in Empire(s)<\/li><li> Bosses going Public<\/li><li> Lifetime boss points for Empire(s)<\/li><li> Flame Thrower Ability<\/li><\/ul><\/blockquote>","date":"Thu, 04 Apr 2013 19:12:00 GMT","type":"article","docId":126747609289,"lastCrawlTimeUTC":1401248416,"timestamp":"Wed, 28 May 2014 03:40:16 GMT"}
,
 {"text":"Issue Category - Gameplay\nArmy Code -A88352\nTime - GMT +2, recurring, not time specific\nIssue Description - I have a problem with the daily login bonuses. Although I have been a daily player for the past weeks (this can be verified), for some reason my daily login counter gets reset. Usually when I have 3-5 days left to get the big reward. Also, I don't see that daily login screen every day. This is really frustrating and I don't know how to fix it.\nI'm back with the same problem. Please guys take a look at this, beacuse it just seems impossbile for me to get the 14 day bonus. Every time I get down to 3 days left, the counter resets. I never got down to 2 days and I play every day (you can check this). I have tried closing the app over night, restarting my phone, nothing works. When I have 3 days left, the next day it sais 13 days left.\nPlease fix this\nLast night my pvp win:loss was about 10200:3430. This morning it is now about 11400:3995. I didn't do any thing overnight to cause this huge jump in wins and losses overnight. Server side mixup?? My executed stat jumped too but my news feed doesn't reflect any such pvp activity.\nOk. I'm really lost now Not sure what to do or where to go Pls. Help. I've tried everything I could I've tried switch to wifi from 3G and back to 3G , tried uninstalling an reinstalling several times making sure I didn't have any other apps running and still getting the same screen. Sorry ! had an issue with connection . Pls try again. This is going on day 4 Sucks bc not only time but money invested too. Any suggestions ??\nChat crashes for everyone when someone doesn't have a name.\nI decided to buy myself a fancypancy name. The name contained emojis. I tried to change it but the game crashed when I hit submit. Everytime I opened the app it started with the namechange dialog.\nI then accessed the game with different account and device. I noticed that my main account didn't have a name. I tried to access chat, but it crashed the app every time I tried access it. I confirmed from other empire members that they were experiencing the same problem, ie. chat was crashing the app. Main main account had posted to the chat just before trying to change the name.\nI guess what happens is that when you buy a name change, it nullifies your name from the db. And the app relies than you cannot continue from the namechange screen if your name is null.\nThis seems like a minor bug...\nBut this is something that could be exploited easily just by spending 10 fp. What if there's a spy on your empire and he/she desides to change his/her name right before EvE battle and just doesn't enter a new one. No one can access the chat.\nWhat if instead of null, you would use a temp name instead?\nIssue Category - Gameplay\nArmy Code - 0A1A3E\nTime - currently and realising The issue since yesterday\nDescription - Health is doing whatever it wants.\nToday - logged in and Health was Down to 6 without anybody attacking me. Before it was around 60.\nYesterday - Health seemed to be sticked at 3. I watched it concretely. It Turned to 4 and After a Second went back to 3.\nFurthermore next Thing. I read in The Forum it would be like this, when combining Lieutenant s The Level is resettet to One. If you put Him to right Hand and make One Boss Fight The original Level is back. I dont know now what is right and whats The Bug.","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101177","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=7","humanLanguage":"en","html":"<ul> <li>  <blockquote>   Issue Category - Gameplay Army Code -A88352 Time - GMT +2, recurring, not time specific  Issue Description - I have a problem with the daily login bonuses. Although I have been a daily player for the past weeks (this can be verified), for some reason my daily login counter gets reset. Usually when I have 3-5 days left to get the big reward. Also, I don't see that daily login screen every day. This is really frustrating and I don't know how to fix it.   I'm back with the same problem. Please guys take a look at this, beacuse it just seems impossbile for me to get the 14 day bonus. Every time I get down to 3 days left, the counter resets. I never got down to 2 days and I play every day (you can check this). I have tried closing the app over night, restarting my phone, nothing works. When I have 3 days left, the next day it sais 13 days left. Please fix this<\/blockquote>  <\/li><li>  <blockquote>Last night my pvp win:loss was about 10200:3430. This morning it is now about 11400:3995. I didn't do any thing overnight to cause this huge jump in wins and losses overnight. Server side mixup?? My executed stat jumped too but my news feed doesn't reflect any such pvp activity.<\/blockquote>  <\/li><li>  <blockquote>Ok. I'm really lost now Not sure what to do or where to go Pls. Help. I've tried everything I could I've tried switch to wifi from 3G and back to 3G , tried uninstalling an reinstalling several times making sure I didn't have any other apps running and still getting the same screen. Sorry ! had an issue with connection . Pls try again. This is going on day 4 Sucks bc not only time but money invested too. Any suggestions ??<\/blockquote>  <\/li><li>  <blockquote>Chat crashes for everyone when someone doesn't have a name.  I decided to buy myself a fancypancy name. The name contained emojis. I tried to change it but the game crashed when I hit submit. Everytime I opened the app it started with the namechange dialog.  I then accessed the game with different account and device. I noticed that my main account didn't have a name. I tried to access chat, but it crashed the app every time I tried access it. I confirmed from other empire members that they were experiencing the same problem, ie. chat was crashing the app. Main main account had posted to the chat just before trying to change the name.  I guess what happens is that when you buy a name change, it nullifies your name from the db. And the app relies than you cannot continue from the namechange screen if your name is null.  This seems like a minor bug...   But this is something that could be exploited easily just by spending 10 fp. What if there's a spy on your empire and he/she desides to change his/her name right before EvE battle and just doesn't enter a new one. No one can access the chat.  What if instead of null, you would use a temp name instead?<\/blockquote>  <\/li><li>  <blockquote>Issue Category - Gameplay Army Code - 0A1A3E Time - currently and realising The issue since yesterday Description - Health is doing whatever it wants. Today - logged in and Health was Down to 6 without anybody attacking me. Before it was around 60. Yesterday - Health seemed to be sticked at 3. I watched it concretely. It Turned to 4 and After a Second went back to 3.  Furthermore next Thing. I read in The Forum it would be like this, when combining Lieutenant s The Level is resettet to One. If you put Him to right Hand and make One Boss Fight The original Level is back. I dont know now what is right and whats The Bug.<\/blockquote>  <\/li> <\/ul>","date":"Fri, 21 Jun 2013 05:03:00 GMT","type":"article","docId":158438541551,"lastCrawlTimeUTC":1401248416,"timestamp":"Wed, 28 May 2014 03:40:16 GMT"}
,
 {"text":"I was at 145k income , clicked to build my first island which would take me to 155k an hour and my achieve tab started flashing \"goals\". Clicked on tab and noticed the achieve for getting 150k income is missing and now says 200k for achieve.\nBasically I haven't received any fp or skill points or whatever for 150k income achieve ( unless my heads screwed and there was never an achieve for 150k lol )\nHey muppet did you click more info to make all the income achievements pop up? Should be able to collect then ^_^\nI was at 145k income , clicked to build my first island which would take me to 155k an hour and my achieve tab started flashing \"goals\". Clicked on tab and noticed the achieve for getting 150k income is missing and now says 200k for achieve.\nBasically I haven't received any fp or skill points or whatever for 150k income achieve ( unless my heads screwed and there was never an achieve for 150k lol )\nperhaps you are confusing the income achievements with some others? there is no income achievement for $150k but there is one for owning 150 properties.\nI'm going mad over here guys :mad: just got my login counter reset AGAIN last night. Had 3 or 4 days left. Please somebody look into this problem. I did unintendedly leave the app running over night. Still I don\"t see why this should reset the counter. It doesn\"t mean I don\"t log in every day, just that I play constantly\nPs: I did press the home screen and it said 13 days left\nI'm going mad over here guys :mad: just got my login counter reset AGAIN last night. Had 3 or 4 days left. Please somebody look into this problem. I did unintendedly leave the app running over night. Still I don\"t see why this should reset the counter. It doesn\"t mean I don\"t log in every day, just that I play constantly\nPs: I did press the home screen and it said 13 days left\nTry restarting your phone everyone you open the app, if you don't get the daily reward that day, it always regestered when I open it in the morning l.\nI actually have two issues. one has been a constant and the other is fairly recent.\nfirst issue, and main one is that the game won't let me purchase fp. I tried a few times already and all I get is an error pop-up saying connection issue. but now the error comes up EVERY time the app is refreshed.\nsecond issue is that I can't gain battle points anymore. I gained up to lvl 17, but now when I attack for points, the game shows I've gained nothing.\nplease help. thank you\nI actually have two issues. one has been a constant and the other is fairly recent.\nfirst issue, and main one is that the game won't let me purchase fp. I tried a few times already and all I get is an error pop-up saying connection issue. but now the error comes up EVERY time the app is refreshed.\nsecond issue is that I can't gain battle points anymore. I gained up to lvl 17, but now when I attack for points, the game shows I've gained nothing.\nplease help. thank you\nAbout the secound issue if you army getting points for rank it means you are negative bp.","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101176","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=6","humanLanguage":"en","html":"<ul> <li>  <blockquote>   I was at 145k income , clicked to build my first island which would take me to 155k an hour and my achieve tab started flashing &quot;goals&quot;. Clicked on tab and noticed the achieve for getting 150k income is missing and now says 200k for achieve.  Basically I haven't received any fp or skill points or whatever for 150k income achieve ( unless my heads screwed and there was never an achieve for 150k lol )    Hey muppet did you click more info to make all the income achievements pop up? Should be able to collect then ^_^<\/blockquote>  <\/li><li>  <blockquote>   I was at 145k income , clicked to build my first island which would take me to 155k an hour and my achieve tab started flashing &quot;goals&quot;. Clicked on tab and noticed the achieve for getting 150k income is missing and now says 200k for achieve.  Basically I haven't received any fp or skill points or whatever for 150k income achieve ( unless my heads screwed and there was never an achieve for 150k lol )   perhaps you are confusing the income achievements with some others? there is no income achievement for $150k but there is one for owning 150 properties.<\/blockquote>  <\/li><li>  <blockquote>I'm going mad over here guys :mad: just got my login counter reset AGAIN last night. Had 3 or 4 days left. Please somebody look into this problem. I did unintendedly leave the app running over night. Still I don&quot;t see why this should reset the counter. It doesn&quot;t mean I don&quot;t log in every day, just that I play constantly  Ps: I did press the home screen and it said 13 days left<\/blockquote>  <\/li><li>  <blockquote>   I'm going mad over here guys :mad: just got my login counter reset AGAIN last night. Had 3 or 4 days left. Please somebody look into this problem. I did unintendedly leave the app running over night. Still I don&quot;t see why this should reset the counter. It doesn&quot;t mean I don&quot;t log in every day, just that I play constantly  Ps: I did press the home screen and it said 13 days left   Try restarting your phone everyone you open the app, if you don't get the daily reward that day, it always regestered when I open it in the morning l.<\/blockquote>  <\/li><li>  <blockquote>I actually have two issues. one has been a constant and the other is fairly recent.  first issue, and main one is that the game won't let me purchase fp. I tried a few times already and all I get is an error pop-up saying connection issue. but now the error comes up EVERY time the app is refreshed.  second issue is that I can't gain battle points anymore. I gained up to lvl 17, but now when I attack for points, the game shows I've gained nothing.  please help. thank you<\/blockquote>  <\/li><li>  <blockquote>   I actually have two issues. one has been a constant and the other is fairly recent.  first issue, and main one is that the game won't let me purchase fp. I tried a few times already and all I get is an error pop-up saying connection issue. but now the error comes up EVERY time the app is refreshed.  second issue is that I can't gain battle points anymore. I gained up to lvl 17, but now when I attack for points, the game shows I've gained nothing.  please help. thank you   About the secound issue if you army getting points for rank it means you are negative bp.<\/blockquote>  <\/li> <\/ul>","date":"Mon, 10 Jun 2013 13:48:00 GMT","type":"article","docId":161350732008,"lastCrawlTimeUTC":1401248417,"timestamp":"Wed, 28 May 2014 03:40:17 GMT"}
,
 {"text":"Was fixed after reinstalling after the mos recent update. Thanks Airmid!\nNow another issue, not sure if it's on my end, but recently whenever I'm on wifi at home, whenever I try to duel/war someone, I get a lot of \"Request timed out.\" but when I switch to my data plan, this doesn't happen.\nSo I thought it might've been a wifi issue. BUT on my other device connected to the same wifi, it doesn't have this same issue. I've tried reinstalling, and resetting my network but to no avail. Any help on this? Thanks :)\nIssue: Gameplay/Sound\nAC: 1F4286\nTime: ES\nSS: N/A\nDescription: Music and sound effects will cut out at times, or sometimes not start up with the game at all. I can go adjust sound levels in game, and when I exit, I am left with sound effects but no music. Clearing the app from multitask once or twice usually clears the sound issue. This is new to me on the latest UE app update for IPhone 4S.\nI am also experiencing a few random crashes, as others have noted, especially during boss fights. Maybe 3 or 4 per day.\nIssue: Gameplay/Sound\nAC: D1EB08\nTime: 4/14 all day\nSS: N/A\nDescription: I got like 2 or 3 daily gifts yesterday. Also, the \"9 days til login bonus!\" thing popped up, but the day didn't change. I think everytime the app process is started (aka when it is NOT in the multitasking tray and it is started) it is not detecting that I have already claimed my login bonus. I should also mention that I did NOT get more than one daily scratcher.\nThis is actually normal for most chat functions. The \"<\" character will delete the line after. It is mainly a purge on coding in chats as less then and greater than are common html markups. (If you use IRC, it will commonly do the same thing. Along with some other chats you may use.)\nNow why is this? Most likely the sanitizing script(s) look(s) for certain things (such as the less than symbol being adjacent to another character).\nTL;DR - Feature not a Bug.\nThis is actually normal for most chat functions. The \"<\" character will delete the line after. It is mainly a purge on coding in chats as less then and greater than are common html markups. (If you use IRC, it will commonly do the same thing. Along with some other chats you may use.)\nNow why is this? Most likely the sanitizing script(s) look(s) for certain things (such as the less than symbol being adjacent to another character).\nTL;DR - Feature not a Bug.\nAhh ok I understand that, thanks for the response\nRight but what's up with these ;) and I'm 100% serious my fox (also on this thread) it is not correct. I'd like it looked at if possible","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101172","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=2","humanLanguage":"en","html":"<ul> <li>  <blockquote>Was fixed after reinstalling after the mos recent update. Thanks Airmid!  Now another issue, not sure if it's on my end, but recently whenever I'm on wifi at home, whenever I try to duel/war someone, I get a lot of &quot;Request timed out.&quot; but when I switch to my data plan, this doesn't happen.  So I thought it might've been a wifi issue. BUT on my other device connected to the same wifi, it doesn't have this same issue. I've tried reinstalling, and resetting my network but to no avail. Any help on this? Thanks :)<\/blockquote>  <\/li><li>  <blockquote>Issue: Gameplay/Sound AC: 1F4286 Time: ES SS: N/A Description: Music and sound effects will cut out at times, or sometimes not start up with the game at all. I can go adjust sound levels in game, and when I exit, I am left with sound effects but no music. Clearing the app from multitask once or twice usually clears the sound issue. This is new to me on the latest UE app update for IPhone 4S.  I am also experiencing a few random crashes, as others have noted, especially during boss fights. Maybe 3 or 4 per day.<\/blockquote>  <\/li><li>  <blockquote>Issue: Gameplay/Sound AC: D1EB08 Time: 4/14 all day SS: N/A Description: I got like 2 or 3 daily gifts yesterday. Also, the &quot;9 days til login bonus!&quot; thing popped up, but the day didn't change. I think everytime the app process is started (aka when it is NOT in the multitasking tray and it is started) it is not detecting that I have already claimed my login bonus. I should also mention that I did NOT get more than one daily scratcher.<\/blockquote>  <\/li><li>  <blockquote>This is actually normal for most chat functions. The &quot;&lt;&quot; character will delete the line after. It is mainly a purge on coding in chats as less then and greater than are common html markups. (If you use IRC, it will commonly do the same thing. Along with some other chats you may use.)   Now why is this? Most likely the sanitizing script(s) look(s) for certain things (such as the less than symbol being adjacent to another character).   TL;DR - Feature not a Bug.<\/blockquote>  <\/li><li>  <blockquote>   This is actually normal for most chat functions. The &quot;&lt;&quot; character will delete the line after. It is mainly a purge on coding in chats as less then and greater than are common html markups. (If you use IRC, it will commonly do the same thing. Along with some other chats you may use.)   Now why is this? Most likely the sanitizing script(s) look(s) for certain things (such as the less than symbol being adjacent to another character).   TL;DR - Feature not a Bug.   Ahh ok I understand that, thanks for the response<\/blockquote>  <\/li><li>  <blockquote>Right but what's up with these ;) and I'm 100% serious my fox (also on this thread) it is not correct. I'd like it looked at if possible <\/blockquote>  <\/li> <\/ul>","date":"Sat, 13 Apr 2013 02:14:00 GMT","type":"article","docId":181715077349,"lastCrawlTimeUTC":1401248417,"timestamp":"Wed, 28 May 2014 03:40:17 GMT"}
,
 {"text":"Hi, I updated our empires battletimes and I tried to add a second battletime(we had only one time selected). How ever, it decided to pick the two battles I did not choose, instead of the two I actually selected. As a result I now have some pretty pissed Empire members as I couldn't switch it back. It says that your battles will be resolved at 12.00 utc. How ever I could not change it back at 11.45.\nAm I doing it wrong or is there some issues with this thing?\nHi, I updated our empires battletimes and I tried to add a second battletime(we had only one time selected). How ever, it decided to pick the two battles I did not choose, instead of the two I actually selected. As a result I now have some pretty pissed Empire members as I couldn't switch it back. It says that your battles will be resolved at 12.00 utc. How ever I could not change it back at 11.45.\nAm I doing it wrong or is there some issues with this thing?\nYou are doing something wrong.\nI understand it says it only updates 1x per day, and I understand how this is stupid for us to continue telling you, but in reality it updates every minute.\nNot sure what you did when changing times or if someone else in your empire also changed times etc BUT... to change times you should ignore the green squares and put a check beside all of the times you would like to fight.\nThanks for the reply :) I _might_ have panicked a bit as it didn't show the chances right away... Felt a little dumb. And still do :p\nIm displeased with this game. About 2 weeks ago when i tried to log in my account was gone. Whether it was hacked or given to someone else idk. I emailed support got no help. It happened to a friend of mine at the same time. He got his back 2 days later! That was 2 weeks ago. Now fast forward to today I updated the app with my other device and that account was no longer there. Instead a level 15 account. I have received absolutely no help in retrieving my 2 accounts. The first a level 70 and the second 73!\nHi,\nthere actually is a bug in selecting battle times that I can reproduce.\nMy times are from top to bottom(utc +3):\n12am\n6am\n12pm\n6pm\nWhen I select only the 12 am battle it selects the 12 pm battle. And vice versa. The 6 a'clock times work as they should.\nIt's not that bad when you know how it works. But it's definitely not working as it should.\n-S\nOne bug I found is that sometimes the tiles up top on the screen (health, money, stamina, energy) will oftentimes get stuck with a 50% transparent white square on top of them. For example, when you click them they turn that white-ish color for a second to show that your click has been registered -- sometimes when I open up the app it permanently has this square on it until I touch it.\nAnother bug that I found is that oftentimes, an extra error message will pop up when a chat error occurs. Whether this chat error is due to the fact that it has been less than 5 seconds since the last message or that \"too many people are chatting\" (upgrade the server >.<), and extra error pops up after that. The error reads \"ERROR RETRIEVING CHAT DATA.\" I feel like this code was probably left in accidentally, if maybe there was a point where that one error message covered everything until the 5 seconds one and the other one were added.\nThis has probably been covered somewhere else, but it's 2 am and I'm a bit too tired to search. That said:\nIssue: gameplay/pvp\nFor the last 8 hours, I haven't been able to see who's been attacking me. The last one that shows up on my feed was from 6 hrs ago, previous to that is 15hrs ago. I just watched my health go from full to zero, checked my news feed, hoping to see who used 20 stamina to kill me, and those two are still there. Not the first time this has happened. Normally, I remove a few of the people from the feed and the rest appear. Not the case this time. Any suggestions?","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101174","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=4","humanLanguage":"en","html":"<ul> <li>  <blockquote>Hi, I updated our empires battletimes and I tried to add a second battletime(we had only one time selected). How ever, it decided to pick the two battles I did not choose, instead of the two I actually selected. As a result I now have some pretty pissed Empire members as I couldn't switch it back. It says that your battles will be resolved at 12.00 utc. How ever I could not change it back at 11.45.   Am I doing it wrong or is there some issues with this thing?<\/blockquote>  <\/li><li>  <blockquote>   Hi, I updated our empires battletimes and I tried to add a second battletime(we had only one time selected). How ever, it decided to pick the two battles I did not choose, instead of the two I actually selected. As a result I now have some pretty pissed Empire members as I couldn't switch it back. It says that your battles will be resolved at 12.00 utc. How ever I could not change it back at 11.45.   Am I doing it wrong or is there some issues with this thing?   You are doing something wrong.  I understand it says it only updates 1x per day, and I understand how this is stupid for us to continue telling you, but in reality it updates every minute.  Not sure what you did when changing times or if someone else in your empire also changed times etc BUT... to change times you should ignore the green squares and put a check beside all of the times you would like to fight.<\/blockquote>  <\/li><li>  <blockquote>Thanks for the reply :) I _might_ have panicked a bit as it didn't show the chances right away... Felt a little dumb. And still do :p<\/blockquote>  <\/li><li>  <blockquote>Im displeased with this game. About 2 weeks ago when i tried to log in my account was gone. Whether it was hacked or given to someone else idk. I emailed support got no help. It happened to a friend of mine at the same time. He got his back 2 days later! That was 2 weeks ago. Now fast forward to today I updated the app with my other device and that account was no longer there. Instead a level 15 account. I have received absolutely no help in retrieving my 2 accounts. The first a level 70 and the second 73!<\/blockquote>  <\/li><li>  <blockquote>Hi,   there actually is a bug in selecting battle times that I can reproduce.  My times are from top to bottom(utc +3): 12am 6am 12pm 6pm When I select only the 12 am battle it selects the 12 pm battle. And vice versa. The 6 a'clock times work as they should. It's not that bad when you know how it works. But it's definitely not working as it should.  -S<\/blockquote>  <\/li><li>  <blockquote>One bug I found is that sometimes the tiles up top on the screen (health, money, stamina, energy) will oftentimes get stuck with a 50% transparent white square on top of them. For example, when you click them they turn that white-ish color for a second to show that your click has been registered -- sometimes when I open up the app it permanently has this square on it until I touch it.<\/blockquote>  <\/li><li>  <blockquote>Another bug that I found is that oftentimes, an extra error message will pop up when a chat error occurs. Whether this chat error is due to the fact that it has been less than 5 seconds since the last message or that &quot;too many people are chatting&quot; (upgrade the server &gt;.&lt;), and extra error pops up after that. The error reads &quot;ERROR RETRIEVING CHAT DATA.&quot; I feel like this code was probably left in accidentally, if maybe there was a point where that one error message covered everything until the 5 seconds one and the other one were added.<\/blockquote>  <\/li><li>  <blockquote>This has probably been covered somewhere else, but it's 2 am and I'm a bit too tired to search. That said: Issue: gameplay/pvp  For the last 8 hours, I haven't been able to see who's been attacking me. The last one that shows up on my feed was from 6 hrs ago, previous to that is 15hrs ago. I just watched my health go from full to zero, checked my news feed, hoping to see who used 20 stamina to kill me, and those two are still there. Not the first time this has happened. Normally, I remove a few of the people from the feed and the rest appear. Not the case this time. Any suggestions?<\/blockquote>  <\/li> <\/ul>","date":"Sat, 25 May 2013 00:55:00 GMT","type":"article","docId":199111428301,"lastCrawlTimeUTC":1401248416,"timestamp":"Wed, 28 May 2014 03:40:16 GMT"}
,
 {"text":"Issue Category -Gameplay\nArmy Code - EE88F0\nTime -multiple times\nScreen Shot - N/a\nIssue Description - Have found when combining lieutenants, that if I switch to another program (to answer a text message, or line/kik) and then come back to UE, that game is not responsive. I cannot click on anything to do anything. I have to exit out of game, and then restart game to get back to where I was. Is repeatable bug.\nIssue Category - Gameplay\nArmy Code - A8B836\nIssue Level - Important\nTime - Multiple times\nIssue description - After buy and spent 3 VIP Packs in crates, I combine some of my lts. I have all my lts at top lvl of their star. But when I combine many of them, they start at lvl 1. The lts with that issue was:\nThe Dragn Lord (35 lvls lost)\nAlpha (30 lvls lost)\nGhost (15 lvls lost)\nShadow (20 lvls lost)\nOfficer Mike (10 lvls lost)\nI know many common lts have the same issue in combine/fuse. But should be better look all list of lts and fix them. In my case, to recover all that lvls (110 in total) is necesary spend too many favor points.\nIssue Category - Gameplay\nArmy Code - AE1D7D\nTime - (11:02am, GMT +8 and 01 05 2014)\nScreen Shot - (if possible)\nIssue Description - i'm having this problem for weeks before i decided to report it, there is alot of missing picture then cannot be displayed.\nEg: Missing[battle_rank_2/rank_14.png]\nMissing[lieutenant_protraits/lieutenant_art/small/lt_stacy_sm.jpg]\nThis is just some of the error im getting.\nThank you !\nIssue Category - Download/Gameplay\nArmy Code - 64AA1E\nTime - 8:37 AM, MST May 2nd 2014\nScreen Shot - (if possible)\nIssue Description - Since updating to IOS 7.1.1 game is broken. I was having an issue same as kianncs getting an error and portraits not loading so I reinstalled. Game will load and I dont get error message anymore but still have issues loading portraits, banners, icons just about anything which makes it impossible to join boss fights let alone see most things. I have tried to fully uninstall and reinstall game a dozen times now and its always the same problem.\nI have iphone5 on version 7.1.1 (11D201)\nIssue Category - Download/Gameplay\nArmy Code - 64AA1E\nTime - 8:37 AM, MST May 2nd 2014\nScreen Shot - (if possible)\nIssue Description - Since updating to IOS 7.1.1 game is broken. I was having an issue same as kianncs getting an error and portraits not loading so I reinstalled. Game will load and I dont get error message anymore but still have issues loading portraits, banners, icons just about anything which makes it impossible to join boss fights let alone see most things. I have tried to fully uninstall and reinstall game a dozen times now and its always the same problem.\nI have iphone5 on version 7.1.1 (11D201)\nTry restarting your device before reinstalling.\n- Tank\nUE is running extremely slow on my iphone 4. I have turned off both the gfx options in settings, exited out of all the other apps that were running in the background. Deleted anything on my phone that wasn't essential, turned off wifi, gps, and anything else that I could in the usage setting on my phone. I've looked up everything I can do to help prevent my phone from running slowly and did it. I even downloaded an app that is supposed to free up your memory, deleted the app and reloaded the app 3 times, and turned my phone off and back on again several times. I've done and redone everything that people have suggested and UE is still running just as slow as it was before. And yes I did get the most recent patch with the stablizing. I don't think it's the iphone 4 that's causing the issue because none of my other apps are having any issues and I don't think it's the new ios update because I have that on my iPad and iPod touch and they run the game just fine.\nIssue Category - gameplay\nArmy Code - 48BE8B\nTime - any EvE\nScreen Shot - (if possible)\nIssue Description -health boost from Centurion is not applied after a BioLab completion.\nAfter a BioLab property is completed, which increases the health by a certain procent, the start health in EvE does not consider if you have Centurion seated or not (at the start of EvE, ofcourse). It fixes itself after you put 1 additional stat in health.\nIssue Category - (Purchase)\nArmy Code - 7979FC\nTime - 4 may 8 am GmT +8 singapore, 4 may 12 pm GmT +8\nScreen Shot - none\nIssue Description -\nWhenever I try to purchase any FP value pack for the promo happening now, it says \"unable to complete your purchase. And unknown error has occurred. Please try again later.\"\nI have tried multiple time yesterday 3 May and today 2 times. Still get same error.\nReally want the freebies for the promo. Can anyone help?\nI have also emailed the underworld support .\nI have also confirm it's only your app that has problems purchasing.\nOther games are ok.\nThanks\nBe carefull with pressing the buy button multiple times, although receiving an error message. Several people were billed each time they pressed buy and got the error message (in your case 5).\nSend a mail to support also, mentioning that you had the respective promo (I believe its a lieutenant promo and you are lower than level 181). If you receive a receipt from iTunes attach that also and explain your problem. It should be possible to award you the promo afterwards.\nHi!\nI think that about a year ago I submitted a bug report on the forums that setting the battle times doesn't work as it should. And I think it got fixed.\nWohoo!!! It's back!!!\nSelecting 12 am battle actually selects the 12 pm battle. How hard can this be?\nSo selecting these\nAttachment 3106\nWill actually select these\nAttachment 3107\nAnd selecting this\nAttachment 3105\nWill give you this\nAttachment 3108\nHave a nice opposite day!\nI am having a similar problem. My alt account on my iPad showed up on my iPhone automatically. When I tried to switch back to my main account I logged back in and was still on my alt account. I finally got an e-mail back from devs but their solution was to use my Apple ID on a new device. That would require me to buy another device, which is not going to happen. Also I have the same Apple ID on all my devices so not sure how logging in on a new device with my Apple ID will fix the issue. If I figure out how to fix this issue I'll repost but I'm waiting for a reply from Airmid to see what other ideas he has to fix this issue.","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|-1239798239","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=14","humanLanguage":"en","html":"<ul> <li>  <blockquote>Issue Category -Gameplay Army Code - EE88F0 Time -multiple times Screen Shot - N/a Issue Description - Have found when combining lieutenants, that if I switch to another program (to answer a text message, or line/kik) and then come back to UE, that game is not responsive. I cannot click on anything to do anything. I have to exit out of game, and then restart game to get back to where I was. Is repeatable bug.<\/blockquote>  <\/li><li>  <blockquote>Issue Category - Gameplay Army Code - A8B836 Issue Level - Important Time - Multiple times Issue description - After buy and spent 3 VIP Packs in crates, I combine some of my lts. I have all my lts at top lvl of their star. But when I combine many of them, they start at lvl 1. The lts with that issue was:  The Drag&oacute;n Lord (35 lvls lost) Alpha (30 lvls lost) Ghost (15 lvls lost) Shadow (20 lvls lost) Officer Mike (10 lvls lost)  I know many common lts have the same issue in combine/fuse. But should be better look all list of lts and fix them. In my case, to recover all that lvls (110 in total) is necesary spend too many favor points.<\/blockquote>  <\/li><li>  <blockquote>Issue Category - Gameplay Army Code - AE1D7D Time - (11:02am, GMT +8 and 01 05 2014) Screen Shot - (if possible) Issue Description - i'm having this problem for weeks before i decided to report it, there is alot of missing picture then cannot be displayed.   Eg: Missing[battle_rank_2/rank_14.png] Missing[lieutenant_protraits/lieutenant_art/small/lt_stacy_sm.jpg]  This is just some of the error im getting.  Thank you !<\/blockquote>  <\/li><li>  <blockquote>Issue Category - Download/Gameplay Army Code - 64AA1E Time - 8:37 AM, MST May 2nd 2014 Screen Shot - (if possible) Issue Description - Since updating to IOS 7.1.1 game is broken. I was having an issue same as kianncs getting an error and portraits not loading so I reinstalled. Game will load and I dont get error message anymore but still have issues loading portraits, banners, icons just about anything which makes it impossible to join boss fights let alone see most things. I have tried to fully uninstall and reinstall game a dozen times now and its always the same problem.  I have iphone5 on version 7.1.1 (11D201)<\/blockquote>  <\/li><li>  <blockquote>   Issue Category - Download/Gameplay Army Code - 64AA1E Time - 8:37 AM, MST May 2nd 2014 Screen Shot - (if possible) Issue Description - Since updating to IOS 7.1.1 game is broken. I was having an issue same as kianncs getting an error and portraits not loading so I reinstalled. Game will load and I dont get error message anymore but still have issues loading portraits, banners, icons just about anything which makes it impossible to join boss fights let alone see most things. I have tried to fully uninstall and reinstall game a dozen times now and its always the same problem.  I have iphone5 on version 7.1.1 (11D201)   Try restarting your device before reinstalling.   - Tank<\/blockquote>  <\/li><li>  <blockquote>UE is running extremely slow on my iphone 4. I have turned off both the gfx options in settings, exited out of all the other apps that were running in the background. Deleted anything on my phone that wasn't essential, turned off wifi, gps, and anything else that I could in the usage setting on my phone. I've looked up everything I can do to help prevent my phone from running slowly and did it. I even downloaded an app that is supposed to free up your memory, deleted the app and reloaded the app 3 times, and turned my phone off and back on again several times. I've done and redone everything that people have suggested and UE is still running just as slow as it was before. And yes I did get the most recent patch with the stablizing. I don't think it's the iphone 4 that's causing the issue because none of my other apps are having any issues and I don't think it's the new ios update because I have that on my iPad and iPod touch and they run the game just fine.<\/blockquote>  <\/li><li>  <blockquote>Issue Category - gameplay Army Code - 48BE8B Time - any EvE Screen Shot - (if possible) Issue Description -health boost from Centurion is not applied after a BioLab completion.  After a BioLab property is completed, which increases the health by a certain procent, the start health in EvE does not consider if you have Centurion seated or not (at the start of EvE, ofcourse). It fixes itself after you put 1 additional stat in health.<\/blockquote>  <\/li><li>  <blockquote>Issue Category - (Purchase) Army Code - 7979FC Time - 4 may 8 am GmT +8 singapore, 4 may 12 pm GmT +8 Screen Shot - none Issue Description - Whenever I try to purchase any FP value pack for the promo happening now, it says &quot;unable to complete your purchase. And unknown error has occurred. Please try again later.&quot;  I have tried multiple time yesterday 3 May and today 2 times. Still get same error.  Really want the freebies for the promo. Can anyone help? I have also emailed the underworld support . I have also confirm it's only your app that has problems purchasing.  Other games are ok. Thanks<\/blockquote>  <\/li><li>  <blockquote>Be carefull with pressing the buy button multiple times, although receiving an error message. Several people were billed each time they pressed buy and got the error message (in your case 5).  Send a mail to support also, mentioning that you had the respective promo (I believe its a lieutenant promo and you are lower than level 181). If you receive a receipt from iTunes attach that also and explain your problem. It should be possible to award you the promo afterwards.<\/blockquote>  <\/li><li>  <blockquote>Hi!   I think that about a year ago I submitted a bug report on the forums that setting the battle times doesn't work as it should. And I think it got fixed.  Wohoo!!! It's back!!! Selecting 12 am battle actually selects the 12 pm battle. How hard can this be?  So selecting these <a href=\"http://underworldempireforums.com/attachment.php?s=3fc5e9a5c9249861e7cf92ee6b86ac43&attachmentid=3106\">Attachment 3106<\/a> Will actually select these <a href=\"http://underworldempireforums.com/attachment.php?s=3fc5e9a5c9249861e7cf92ee6b86ac43&attachmentid=3107\">Attachment 3107<\/a>  And selecting this <a href=\"http://underworldempireforums.com/attachment.php?s=3fc5e9a5c9249861e7cf92ee6b86ac43&attachmentid=3105\">Attachment 3105<\/a> Will give you this <a href=\"http://underworldempireforums.com/attachment.php?s=3fc5e9a5c9249861e7cf92ee6b86ac43&attachmentid=3108\">Attachment 3108<\/a>  Have a nice opposite day!<\/blockquote>  <\/li><li>  <blockquote>I am having a similar problem. My alt account on my iPad showed up on my iPhone automatically. When I tried to switch back to my main account I logged back in and was still on my alt account. I finally got an e-mail back from devs but their solution was to use my Apple ID on a new device. That would require me to buy another device, which is not going to happen. Also I have the same Apple ID on all my devices so not sure how logging in on a new device with my Apple ID will fix the issue. If I figure out how to fix this issue I'll repost but I'm waiting for a reply from Airmid to see what other ideas he has to fix this issue.<\/blockquote>  <\/li> <\/ul>","date":"Sat, 19 Apr 2014 00:48:00 GMT","type":"article","docId":243132860611,"lastCrawlTimeUTC":1401248420,"timestamp":"Wed, 28 May 2014 03:40:20 GMT"}
,
 {"text":"Ok, that does sound reasonable...\nBut the thing is, that I'm not seeing class bonus against heavy. It's exactly the same score when I attack sniper. Only assassins gives me more points.\nAtleast this has been the case in my current Illuminati. Damage done to that penelope sniper is exactly the same than the damage done to the heavies. I'm using my class specific attack. I've had the same LT's up for the whole time.\nAnd yes, I've double checked that I really am playing as an assassin.\nSorry Cannot retrieve raw data I keep getting this message everywhere I click on and it loads i can't progress to the next page because it doesont load and then pops up please help me I already tried deleting and installing\nI'm beginning to feel bad... Again I _think_ I've found a bug...\nFrom time to time when I open the game I get a notice that my third or fourth LT seat has been unlocked. I really haven't paid attention what seat it is....\nThe second thing is that also from time to time my underboss seat is emptied... So no LT is seated there and no one has the bonuses.\nI can provide the screenshots as a proof if necessary(about the empty seat)...\nYeah unfortunately we noticed this was an issue in the 1.45 client. Good news is it is fixed in 1.50. Bad news is you have to wait until 1.50 is released to correct the issue.\nAs a temporary work-around, you could try the guess and check method as there are a few places where you can see your empire's banner AFTER you set it.\nGame Bug and Issue Thread!\nWe, the Underworld Empire Team, are always looking for ways to improve our product. One way you can help us to do so is to report bugs and common issues you have found while playing the game.\nBefore you post, Please check our System Requirements.\nFeel free to post the issues you find below using the following format:\nIssue Category - (Download, Purchase, Connection, Gameplay)\nArmy Code -\nTime - (Time, Time Zone and Date)\nScreen Shot - (if possible)\nIssue Description -\nWe want to insure you have the best experience possible while playing Underworld Empire!\nIf you have a more personal or larger issue, please contact out Support Team at support.underworld@phoenixage.com\nWhat has been address on this thread so far:\nItems that have already been fixed: Boss Collection\nExecution Progress\nRespect Reseting\nEmpire Leader List Rubberbanding Issue\nWall Overload Issue(s)\nRe-assignment of Lieutenants\niPhone UI\nCrashes and Timing Out (Memory Leakage)\nBoss Disappearance\nWeapon cache\nSwitching Between Bosses\nRepeat Action during Boss Fights\nExecution Buffs\nPush Notifications\nEmpire Boss Leaderboards\nAwarded Lieutenant(s)\nLieutenant Leveling System\nPenelope's Ability Power\nAffiliation Incorrect Showing\nItaly Job UI\nSummoning Italy Boss\nBanking Load - Unable to Leave\nTypos found in random areas\nSorting Empire\nSorting Allies\nWeapons Purchase\nViewing Players in Empire\nWall Post Limits\nEpic Threshold for Phoenix Boss\nEnforcers should give the same (or close to) contribution as killing an assasing for the same amount of stamina\nReplying to Post(s) Crash\nDaily Reward(s)\nEmpire Battle(s) Auto Collect\nEmpire Battle Class Abilities\nWorking as Intended: Allies being able to attack Allies\nNon-Unique User Names In-Game\nHeath Jumps when attacked in Hospital\nDuke's Ability Power - While equipped, Power Attacks now use X times the Stamina and damage is increased by X times.\nCost of Challenge Jobs\nBeing Unable to See Diamond in Tech Lab until Level 100\nCharmaine's Ability Power\nGifting\nCenturion's Health Bonus - Must be equipped before Empire Wars begin\n: Properties and LT Abilities Check\nPending Request(s) in Empire(s)\nBosses going Public\nLifetime boss points for Empire(s)\nFlame Thrower Ability\nvery major issue!!!!!! on my empire i cannot change the war at 4am, when itry to it says that it will be put into effect from 12am but it never does, so we always have a war in this one stupid time when no one is online and we lose\nthanks\nYour name can only be so many characters in length, and those special characters are each counting for several normal ones. The renaming screen is not informing you in advance that your name will be truncated, but it will if your name is that long and it contains special characters","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101179","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=9","humanLanguage":"en","html":"<ul> <li>  <blockquote>Ok, that does sound reasonable...   But the thing is, that I'm not seeing class bonus against heavy. It's exactly the same score when I attack sniper. Only assassins gives me more points.   Atleast this has been the case in my current Illuminati. Damage done to that penelope sniper is exactly the same than the damage done to the heavies. I'm using my class specific attack. I've had the same LT's up for the whole time.  And yes, I've double checked that I really am playing as an assassin.<\/blockquote>  <\/li><li>  <blockquote>Sorry Cannot retrieve raw data I keep getting this message everywhere I click on and it loads i can't progress to the next page because it doesont load and then pops up please help me I already tried deleting and installing<\/blockquote>  <\/li><li>  <blockquote>I'm beginning to feel bad... Again I _think_ I've found a bug...   From time to time when I open the game I get a notice that my third or fourth LT seat has been unlocked. I really haven't paid attention what seat it is....   The second thing is that also from time to time my underboss seat is emptied... So no LT is seated there and no one has the bonuses.  I can provide the screenshots as a proof if necessary(about the empty seat)...<\/blockquote>  <\/li><li>  <blockquote>Yeah unfortunately we noticed this was an issue in the 1.45 client. Good news is it is fixed in 1.50. Bad news is you have to wait until 1.50 is released to correct the issue.  As a temporary work-around, you could try the guess and check method as there are a few places where you can see your empire's banner AFTER you set it.<\/blockquote>  <\/li><li>  <blockquote>   <u>Game Bug and Issue Thread!<\/u>   We, the Underworld Empire Team, are always looking for ways to improve our product. One way you can help us to do so is to report bugs and common issues you have found while playing the game.   Before you post, Please check our <a href=\"http://underworldempireforums.com/showthread.php?945-Information-System-Requirements&p=996#post996\"> System Requirements<\/a>.  Feel free to post the issues you find below using the following format:   Issue Category - (Download, Purchase, Connection, Gameplay) Army Code - Time - (Time, Time Zone and Date)  Screen Shot - (if possible) Issue Description -  We want to insure you have the best experience possible while playing Underworld Empire!   If you have a more personal or larger issue, please contact out Support Team at <a href=\"mailto:support.underworld@phoenixage.com\">support.underworld@phoenixage.com<\/a>   <u><b>What has been address on this thread so far: <\/b><\/u>  <b>Items that have already been fixed<\/b>: <ul><li> Boss Collection<\/li><li> Execution Progress<\/li><li> Respect Reseting<\/li><li> Empire Leader List Rubberbanding Issue<\/li><li> Wall Overload Issue(s)<\/li><li> Re-assignment of Lieutenants<\/li><li> iPhone UI<\/li><li> Crashes and Timing Out (Memory Leakage)<\/li><li> Boss Disappearance<\/li><li> Weapon cache<\/li><li> Switching Between Bosses<\/li><li> Repeat Action during Boss Fights<\/li><li> Execution Buffs<\/li><li> Push Notifications<\/li><li> Empire Boss Leaderboards<\/li><li> Awarded Lieutenant(s)<\/li><li> Lieutenant Leveling System<\/li><li> Penelope's Ability Power<\/li><li> Affiliation Incorrect Showing<\/li><li> Italy Job UI<\/li><li> Summoning Italy Boss<\/li><li> Banking Load - Unable to Leave<\/li><li> Typos found in random areas<\/li><li> Sorting Empire<\/li><li> Sorting Allies<\/li><li> Weapons Purchase<\/li><li> Viewing Players in Empire<\/li><li> Wall Post Limits<\/li><li> Epic Threshold for Phoenix Boss<\/li><li> Enforcers should give the same (or close to) contribution as killing an assasing for the same amount of stamina<\/li><li> Replying to Post(s) Crash<\/li><li> Daily Reward(s)<\/li><li> Empire Battle(s) Auto Collect<\/li><li> Empire Battle Class Abilities<\/li><\/ul>  <b>Working as Intended:<\/b> <ul><li> Allies being able to attack Allies<\/li><li> Non-Unique User Names In-Game<\/li><li> Heath Jumps when attacked in Hospital<\/li><li> Duke's Ability Power - While equipped, Power Attacks now use X times the Stamina and damage is increased by X times.<\/li><li> Cost of Challenge Jobs<\/li><li> Being Unable to See Diamond in Tech Lab until Level 100<\/li><li> Charmaine's Ability Power<\/li><li> Gifting<\/li><li> Centurion's Health Bonus - Must be equipped before Empire Wars begin<\/li><\/ul>  : <ul><li> Properties and LT Abilities Check<\/li><li> Pending Request(s) in Empire(s)<\/li><li> Bosses going Public<\/li><li> Lifetime boss points for Empire(s)<\/li><li> Flame Thrower Ability<\/li><\/ul>   very major issue!!!!!! on my empire i cannot change the war at 4am, when itry to it says that it will be put into effect from 12am but it never does, so we always have a war in this one stupid time when no one is online and we lose  thanks<\/blockquote>  <\/li><li>  <blockquote>Your name can only be so many characters in length, and those special characters are each counting for several normal ones. The renaming screen is not informing you in advance that your name will be truncated, but it will if your name is that long and it contains special characters<\/blockquote>  <\/li> <\/ul>","date":"Fri, 12 Jul 2013 21:09:00 GMT","type":"article","docId":254334208249,"lastCrawlTimeUTC":1401248417,"timestamp":"Wed, 28 May 2014 03:40:17 GMT"}
,
 {"text":"Several empires are being credited 5 wars a day within a 24 hr period. These empires post an incredible 150 wars a month. The leaderboard means nothing if these empires get 2 wins for 1 war fought... What are we fighting for then? \nI posted in General Discussion but no devs respond to that thread... I'm not asking u guys to fix it asap coz I know u are pretty busy and are working hard. But at least give us a response... Just like tell me u are aware of this problem and are working on it. That's all I'm asking for.\nThx devs.  Pls keep being awesome!\nReally Hammer ? They are getting an extra win, that's grimey and it explains why so many in legend that have 0 business being there. Some have as many losses as wins but are in top 10 figure that one out hahaha. Either way good catch Hammer.\nSeveral empires are being credited 5 wars a day within a 24 hr period. These empires post an incredible 150 wars a month. The leaderboard means nothing if these empires get 2 wins for 1 war fought... What are we fighting for then? \nI posted in General Discussion but no devs respond to that thread... I'm not asking u guys to fix it asap coz I know u are pretty busy and are working hard. But at least give us a response... Just like tell me u are aware of this problem and are working on it. That's all I'm asking for.\nThx devs.  Pls keep being awesome!\nI'm battle rank 14 and now when I look at the home screen, instead of seeing how many points I have towards my next rank, it just says \"Battle other players for rank\". Did the developers take that away or is my app just being dumb?\nIt means you lost too many battles, therefore, too many points and you are under what you should be. Keep fighting and when you have the correct amount of points for your rank it will show you your points again\nIt means you lost too battles, therefore, too many points and you are under what you should be. Keep fighting and when you have the correct amount of points for your rank it will show you your points again\nThanks buddy\nThanks for this note. I just did some testing on my own account as well as the beta. In the beta build 1.42, which is the next update, this is not an issue. However it seems in the current production build (1.37), if you access your wall from your profile the red X User interface disappears but the function is still there. If you access it from your news feed, the red \"x\" is there.\nIf you want to see the red X, for a couple of days just access from the newsfeed instead of profile.\nThank u Manimal I think u are right, it's happening to a lot of empires but for some reason only a handful of empires get really huge number of wars they didn't fight...I suspect it's because they constantly change their war times to b able to fight 4 wars a day, because I know some ppl in those empires and coincidently those with 150 wars credited a month are those who always fight 4 wars a day...\nIf u want u can check the General Discussion there's a thread called \"How could some empires fight 150 wars a month?\"... That was how I first spotted something might b wrong coz in the month of April they fought 150 wars...\nThank u and hope u guys find out what's going on and fix it soon. ","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101173","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=3","humanLanguage":"en","html":"<ul> <li>  <blockquote>Several empires are being credited 5 wars a day within a 24 hr period. These empires post an incredible 150 wars a month. The leaderboard means nothing if these empires get 2 wins for 1 war fought... What are we fighting for then?    I posted in General Discussion but no devs respond to that thread... I'm not asking u guys to fix it asap coz I know u are pretty busy and are working hard. But at least give us a response... Just like tell me u are aware of this problem and are working on it. That's all I'm asking for.   Thx devs.  Pls keep being awesome!<\/blockquote>  <\/li><li>  <blockquote>Really Hammer ? They are getting an extra win, that's grimey and it explains why so many in legend that have 0 business being there. Some have as many losses as wins but are in top 10 figure that one out hahaha. Either way good catch Hammer.       Several empires are being credited 5 wars a day within a 24 hr period. These empires post an incredible 150 wars a month. The leaderboard means nothing if these empires get 2 wins for 1 war fought... What are we fighting for then?    I posted in General Discussion but no devs respond to that thread... I'm not asking u guys to fix it asap coz I know u are pretty busy and are working hard. But at least give us a response... Just like tell me u are aware of this problem and are working on it. That's all I'm asking for.   Thx devs.  Pls keep being awesome!   <\/blockquote>  <\/li><li>  <blockquote>I'm battle rank 14 and now when I look at the home screen, instead of seeing how many points I have towards my next rank, it just says &quot;Battle other players for rank&quot;. Did the developers take that away or is my app just being dumb?<\/blockquote>  <\/li><li>  <blockquote>It means you lost too many battles, therefore, too many points and you are under what you should be. Keep fighting and when you have the correct amount of points for your rank it will show you your points again<\/blockquote>  <\/li><li>  <blockquote>   It means you lost too battles, therefore, too many points and you are under what you should be. Keep fighting and when you have the correct amount of points for your rank it will show you your points again   Thanks buddy<\/blockquote>  <\/li><li>  <blockquote> Thanks for this note. I just did some testing on my own account as well as the beta. In the beta build 1.42, which is the next update, this is not an issue. However it seems in the current production build (1.37), if you access your wall from your profile the red X User interface disappears but the function is still there. If you access it from your news feed, the red &quot;x&quot; is there.   If you want to see the red X, for a couple of days just access from the newsfeed instead of profile.<\/blockquote>  <\/li><li>  <blockquote>Thank u Manimal I think u are right, it's happening to a lot of empires but for some reason only a handful of empires get really huge number of wars they didn't fight...I suspect it's because they constantly change their war times to b able to fight 4 wars a day, because I know some ppl in those empires and coincidently those with 150 wars credited a month are those who always fight 4 wars a day...   If u want u can check the General Discussion there's a thread called &quot;How could some empires fight 150 wars a month?&quot;... That was how I first spotted something might b wrong coz in the month of April they fought 150 wars...   Thank u and hope u guys find out what's going on and fix it soon. <\/blockquote>  <\/li> <\/ul>","date":"Fri, 17 May 2013 23:19:00 GMT","type":"article","docId":257395017962,"lastCrawlTimeUTC":1401248418,"timestamp":"Wed, 28 May 2014 03:40:18 GMT"}
,
 {"text":"Hi, love the game so far but encountered my first bug today. Details below. Thanks!\nIssue Category - Gameplay\nArmy Code -\nTime - 11:00 am (recurring), US Central Time, June 6, 2013\nScreen Shot - n/a\nIssue Description - I received a new lieutenant and the lieutenant button showed a message icon. When I try to access the lieutenant page the game freezes for a second then closes. The app is actually still running, but it takes me to my phone's home screen. It reopens without any issue and all other game functions seem to be working. However, anytime I try to open the lieutenants page it closes. I tried shutting down the app and restarting it; also tried powering down the phone. No luck. Any suggestions?\nTry updating to version 1.42. If this does not help, contact us again.\nHi, love the game so far but encountered my first bug today. Details below. Thanks!\nIssue Category - Gameplay\nArmy Code -\nTime - 11:00 am (recurring), US Central Time, June 6, 2013\nScreen Shot - n/a\nIssue Description - I received a new lieutenant and the lieutenant button showed a message icon. When I try to access the lieutenant page the game freezes for a second then closes. The app is actually still running, but it takes me to my phone's home screen. It reopens without any issue and all other game functions seem to be working. However, anytime I try to open the lieutenants page it closes. I tried shutting down the app and restarting it; also tried powering down the phone. No luck. Any suggestions?\nNot much of a big issue but I noticed the ipad update doesn't display the game using the entire screen. Still has a border on the sides just like when using the 2x iPhone version. I deleted the game and reinstalled but still displays the same.\nDoes it matter that this is happening on a ipad 4 retina? Different screen res, ect.\nWe needed to keep aspect ratio the same as on phone. If we did not make this concession there would not be an iPad version.\nBug or feature? I added 3* Scorpion mid-battle eve and tried to execute over 600 health, of course failed, but message states must be 412 health, which should really read under 412 health.\nHowever, don't think I should be able to add LT mid-battle and change my execute threshold. ;-)\nCouldn't find someone between 400-411 to try to see if actually worked, but error message gave me idea it might. Will attempt next battle and update.\nI am just wondering if anyone is facing or ever encountered the same issue. All along I had no issues with gifting up until 2 days ago.\nNow, whenever I select 'Gift', a message would popup saying: Sorry! Error getting data.\nI have closed the app from the multitasking bar and reloaded it, and also deleted the app and reinstalled via app store but the issue remains.\nIs there any fix for this? Thanks.\nIssue Category - Gameplay\nArmy Code -A88352\nTime - GMT +2, recurring, not time specific\nIssue Description - I have a problem with the daily login bonuses. Although I have been a daily player for the past weeks (this can be verified), for some reason my daily login counter gets reset. Usually when I have 3-5 days left to get the big reward. Also, I don't see that daily login screen every day. This is really frustrating and I don't know how to fix it.\nI was at 145k income , clicked to build my first island which would take me to 155k an hour and my achieve tab started flashing \"goals\". Clicked on tab and noticed the achieve for getting 150k income is missing and now says 200k for achieve.\nBasically I haven't received any fp or skill points or whatever for 150k income achieve ( unless my heads screwed and there was never an achieve for 150k lol )","title":"Bug and Issue Thread v1.0","diffbotUri":"article|3|237101175","pageUrl":"http://www.underworldempireforums.com/printthread.php?t=1877&pp=20&page=5","humanLanguage":"en","html":"<ul> <li>  <blockquote>Hi, love the game so far but encountered my first bug today. Details below. Thanks!  Issue Category - Gameplay Army Code -  Time - 11:00 am (recurring), US Central Time, June 6, 2013  Screen Shot - n/a Issue Description - I received a new lieutenant and the lieutenant button showed a message icon. When I try to access the lieutenant page the game freezes for a second then closes. The app is actually still running, but it takes me to my phone's home screen. It reopens without any issue and all other game functions seem to be working. However, anytime I try to open the lieutenants page it closes. I tried shutting down the app and restarting it; also tried powering down the phone. No luck. Any suggestions?<\/blockquote>  <\/li><li>  <blockquote>Try updating to version 1.42. If this does not help, contact us again.      Hi, love the game so far but encountered my first bug today. Details below. Thanks!  Issue Category - Gameplay Army Code -  Time - 11:00 am (recurring), US Central Time, June 6, 2013  Screen Shot - n/a Issue Description - I received a new lieutenant and the lieutenant button showed a message icon. When I try to access the lieutenant page the game freezes for a second then closes. The app is actually still running, but it takes me to my phone's home screen. It reopens without any issue and all other game functions seem to be working. However, anytime I try to open the lieutenants page it closes. I tried shutting down the app and restarting it; also tried powering down the phone. No luck. Any suggestions?   <\/blockquote>  <\/li><li>  <blockquote>   Not much of a big issue but I noticed the ipad update doesn't display the game using the entire screen. Still has a border on the sides just like when using the 2x iPhone version. I deleted the game and reinstalled but still displays the same.  Does it matter that this is happening on a ipad 4 retina? Different screen res, ect.   We needed to keep aspect ratio the same as on phone. If we did not make this concession there would not be an iPad version.<\/blockquote>  <\/li><li>  <blockquote>Bug or feature? I added 3* Scorpion mid-battle eve and tried to execute over 600 health, of course failed, but message states must be 412 health, which should really read under 412 health.  However, don't think I should be able to add LT mid-battle and change my execute threshold. ;-)   Couldn't find someone between 400-411 to try to see if actually worked, but error message gave me idea it might. Will attempt next battle and update.<\/blockquote>  <\/li><li>  <blockquote>I am just wondering if anyone is facing or ever encountered the same issue. All along I had no issues with gifting up until 2 days ago.  Now, whenever I select 'Gift', a message would popup saying: Sorry! Error getting data.  I have closed the app from the multitasking bar and reloaded it, and also deleted the app and reinstalled via app store but the issue remains. Is there any fix for this? Thanks.<\/blockquote>  <\/li><li>  <blockquote>Issue Category - Gameplay Army Code -A88352 Time - GMT +2, recurring, not time specific  Issue Description - I have a problem with the daily login bonuses. Although I have been a daily player for the past weeks (this can be verified), for some reason my daily login counter gets reset. Usually when I have 3-5 days left to get the big reward. Also, I don't see that daily login screen every day. This is really frustrating and I don't know how to fix it.<\/blockquote>  <\/li><li>  <blockquote>I was at 145k income , clicked to build my first island which would take me to 155k an hour and my achieve tab started flashing &quot;goals&quot;. Clicked on tab and noticed the achieve for getting 150k income is missing and now says 200k for achieve.  Basically I haven't received any fp or skill points or whatever for 150k income achieve ( unless my heads screwed and there was never an achieve for 150k lol )<\/blockquote>  <\/li> <\/ul>","date":"Thu, 06 Jun 2013 16:22:00 GMT","type":"article","docId":264014743760,"lastCrawlTimeUTC":1401248416,"timestamp":"Wed, 28 May 2014 03:40:16 GMT"}
]
